-- MariaDB dump 10.19  Distrib 10.4.32-MariaDB, for Win64 (AMD64)
--
-- Host: localhost    Database: conta_template
-- ------------------------------------------------------
-- Server version	11.4.4-MariaDB

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `detalle_cotizacion`
--

DROP TABLE IF EXISTS `detalle_cotizacion`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `detalle_cotizacion` (
  `id_detalle_cotiza` int(11) NOT NULL AUTO_INCREMENT,
  `item_pro` int(11) NOT NULL,
  `cant_pro` float NOT NULL,
  `precio_v` double NOT NULL,
  `descuento` double NOT NULL,
  `id_cotizacion` int(11) NOT NULL,
  PRIMARY KEY (`id_detalle_cotiza`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `detalle_cotizacion`
--

LOCK TABLES `detalle_cotizacion` WRITE;
/*!40000 ALTER TABLE `detalle_cotizacion` DISABLE KEYS */;
/*!40000 ALTER TABLE `detalle_cotizacion` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `detalle_fact_abietas`
--

DROP TABLE IF EXISTS `detalle_fact_abietas`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `detalle_fact_abietas` (
  `id_detalle_ab` int(11) NOT NULL AUTO_INCREMENT,
  `id_fac_ab` int(11) NOT NULL,
  `item_pro` int(11) NOT NULL,
  `cant_pro` float NOT NULL,
  `precio_v` double NOT NULL,
  `descuento` double NOT NULL,
  PRIMARY KEY (`id_detalle_ab`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `detalle_fact_abietas`
--

LOCK TABLES `detalle_fact_abietas` WRITE;
/*!40000 ALTER TABLE `detalle_fact_abietas` DISABLE KEYS */;
/*!40000 ALTER TABLE `detalle_fact_abietas` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `facturasv_abiertas`
--

DROP TABLE IF EXISTS `facturasv_abiertas`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `facturasv_abiertas` (
  `id_fac_ab` int(11) NOT NULL AUTO_INCREMENT,
  `fecha` date NOT NULL,
  `termino` varchar(15) NOT NULL,
  `dias` int(11) NOT NULL,
  `codigo_cli` int(11) NOT NULL,
  `identificacion_cli` varchar(15) NOT NULL,
  `nombres_cli` varchar(55) NOT NULL,
  `lista_precio` int(11) NOT NULL,
  `total_factura` double NOT NULL,
  `fecha_hora_creado` datetime NOT NULL,
  PRIMARY KEY (`id_fac_ab`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `facturasv_abiertas`
--

LOCK TABLES `facturasv_abiertas` WRITE;
/*!40000 ALTER TABLE `facturasv_abiertas` DISABLE KEYS */;
/*!40000 ALTER TABLE `facturasv_abiertas` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tblarticulos`
--

DROP TABLE IF EXISTS `tblarticulos`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tblarticulos` (
  `Items` int(11) NOT NULL,
  `Codigo` varchar(25) DEFAULT NULL,
  `CodigoB` varchar(15) DEFAULT NULL,
  `Nombres_Articulo` varchar(150) DEFAULT NULL,
  `Id_Categoria` int(11) DEFAULT NULL,
  `Id_Referencia` int(11) DEFAULT NULL,
  `Existencia` float DEFAULT NULL,
  `Existencia_minima` float DEFAULT NULL,
  `Precio_Costo` decimal(19,4) DEFAULT NULL,
  `Precio_CostoComp` decimal(19,4) DEFAULT NULL,
  `Iva` float DEFAULT NULL,
  `Precio_Venta` decimal(19,4) DEFAULT NULL,
  `Precio_Venta2` decimal(19,4) DEFAULT NULL,
  `Precio_Venta3` decimal(19,4) DEFAULT NULL,
  `Fecha_Vencimiento` datetime DEFAULT NULL,
  `CodigoPro` int(11) DEFAULT NULL,
  `Estante` varchar(10) DEFAULT NULL,
  `Flete` decimal(19,4) DEFAULT NULL,
  `ArticuloDe` varchar(10) DEFAULT NULL,
  `Ganancia` int(11) DEFAULT NULL,
  `Sindescuento` tinyint(1) DEFAULT NULL,
  `Precio_Minimo` decimal(19,4) DEFAULT NULL,
  `PlanSepare` int(11) DEFAULT NULL,
  `Servicio` int(11) DEFAULT NULL,
  `Unidades` int(11) DEFAULT NULL,
  `CuponDesc` int(11) DEFAULT NULL,
  `Estado` int(11) DEFAULT NULL,
  `FechaElim` datetime DEFAULT NULL,
  `FechaMod` datetime DEFAULT NULL,
  PRIMARY KEY (`Items`),
  KEY `Codigo` (`Codigo`),
  KEY `Nombres_Articulo` (`Nombres_Articulo`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tblarticulos`
--

LOCK TABLES `tblarticulos` WRITE;
/*!40000 ALTER TABLE `tblarticulos` DISABLE KEYS */;
/*!40000 ALTER TABLE `tblarticulos` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tblauxiliarbanco`
--

DROP TABLE IF EXISTS `tblauxiliarbanco`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tblauxiliarbanco` (
  `idAuxiliarBanco` int(11) NOT NULL,
  `FechaCreacion` datetime DEFAULT NULL,
  `idBancos` int(11) NOT NULL,
  `Detalle` varchar(100) NOT NULL,
  `Valor` decimal(19,4) NOT NULL,
  `NRecivo` int(11) DEFAULT NULL,
  `NFactura` int(11) DEFAULT NULL,
  `TipoMov` int(11) DEFAULT NULL,
  `NRemision` int(11) DEFAULT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tblauxiliarbanco`
--

LOCK TABLES `tblauxiliarbanco` WRITE;
/*!40000 ALTER TABLE `tblauxiliarbanco` DISABLE KEYS */;
/*!40000 ALTER TABLE `tblauxiliarbanco` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tblauxiliares`
--

DROP TABLE IF EXISTS `tblauxiliares`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tblauxiliares` (
  `Id_Auxiliar` int(11) NOT NULL DEFAULT 0,
  `Año` int(11) DEFAULT 0,
  `Fecha` timestamp NOT NULL DEFAULT current_timestamp(),
  `Mes` varchar(15) DEFAULT 'Enero',
  `Cuenta` varchar(50) DEFAULT '000',
  `Detalle` varchar(150) DEFAULT '-',
  `C_D` int(11) DEFAULT 0,
  `Debe` decimal(19,4) DEFAULT 0.0000,
  `Haber` decimal(19,4) DEFAULT 0.0000,
  `Saldo` decimal(19,4) DEFAULT 0.0000,
  PRIMARY KEY (`Id_Auxiliar`),
  KEY `Id_Auxiliar` (`Id_Auxiliar`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tblauxiliares`
--

LOCK TABLES `tblauxiliares` WRITE;
/*!40000 ALTER TABLE `tblauxiliares` DISABLE KEYS */;
INSERT INTO `tblauxiliares` VALUES (1,0,'2025-07-04 05:00:00','Enero','1305','Pago de Facturas Nº 764',1016,0.0000,20000.0000,-20000.0000),(2,0,'2025-07-04 05:00:00','Enero','130672','Pago de Facturas Nº 764',1016,0.0000,20000.0000,-20000.0000),(3,0,'2025-07-04 05:00:00','Enero','1105','Pago de Facturas Nº 764',1016,20000.0000,0.0000,20000.0000),(4,0,'2025-07-04 05:00:00','Enero','1305','Pago de Facturas Nº 783',1017,0.0000,31000.0000,-51000.0000),(5,0,'2025-07-04 05:00:00','Enero','130526','Pago de Facturas Nº 783',1017,0.0000,31000.0000,-31000.0000),(6,0,'2025-07-04 05:00:00','Enero','1105','Pago de Facturas Nº 783',1017,31000.0000,0.0000,51000.0000),(7,0,'2025-07-04 05:00:00','Enero','1305','Pago de Facturas Nº 800',1017,0.0000,35000.0000,-86000.0000),(8,0,'2025-07-04 05:00:00','Enero','130526','Pago de Facturas Nº 800',1017,0.0000,35000.0000,-66000.0000),(9,0,'2025-07-04 05:00:00','Enero','1105','Pago de Facturas Nº 800',1017,35000.0000,0.0000,86000.0000),(10,0,'2025-07-05 05:00:00','Enero','1305','Pago de Facturas Nº 797',1018,0.0000,48000.0000,-134000.0000),(11,0,'2025-07-05 05:00:00','Enero','130633','Pago de Facturas Nº 797',1018,0.0000,48000.0000,-48000.0000),(12,0,'2025-07-05 05:00:00','Enero','1105','Pago de Facturas Nº 797',1018,48000.0000,0.0000,134000.0000),(13,0,'2025-07-05 05:00:00','Enero','1305','Pago de Facturas Nº 806',1019,0.0000,30000.0000,-164000.0000),(14,0,'2025-07-05 05:00:00','Enero','130627','Pago de Facturas Nº 806',1019,0.0000,30000.0000,-30000.0000),(15,0,'2025-07-05 05:00:00','Enero','1105','Pago de Facturas Nº 806',1019,30000.0000,0.0000,164000.0000),(16,0,'2025-07-05 05:00:00','Enero','1305','Pago de Facturas Nº 771',1020,0.0000,15000.0000,-179000.0000),(17,0,'2025-07-05 05:00:00','Enero','130673','Pago de Facturas Nº 771',1020,0.0000,15000.0000,-15000.0000),(18,0,'2025-07-05 05:00:00','Enero','1105','Pago de Facturas Nº 771',1020,15000.0000,0.0000,179000.0000),(19,0,'2025-07-03 05:00:00','Enero','1305','Venta al crédito según Fact. 808',808,140000.0000,0.0000,0.0000),(20,0,'2025-07-03 05:00:00','Enero','130540','Venta al crédito según Fact. 808',808,140000.0000,0.0000,0.0000),(21,0,'2025-06-23 05:00:00','Enero','1305','Venta al crédito según Fact. 809',809,140000.0000,0.0000,0.0000),(22,0,'2025-06-23 05:00:00','Enero','130649','Venta al crédito según Fact. 809',809,140000.0000,0.0000,0.0000),(23,0,'2025-06-23 05:00:00','Enero','1105','Venta al Contado según Fact. 810',810,85000.0000,0.0000,0.0000),(24,0,'2025-07-02 05:00:00','Enero','1305','Venta al crédito según Fact. 811',811,70000.0000,0.0000,0.0000),(25,0,'2025-07-02 05:00:00','Enero','130635','Venta al crédito según Fact. 811',811,70000.0000,0.0000,0.0000),(26,0,'2025-06-20 05:00:00','Enero','1305','Venta al crédito según Fact. 813',813,25000.0000,0.0000,0.0000),(27,0,'2025-06-20 05:00:00','Enero','130593','Venta al crédito según Fact. 813',813,25000.0000,0.0000,0.0000),(28,0,'2025-07-05 05:00:00','Enero','1305','Venta al crédito según Fact. 814',814,120000.0000,0.0000,0.0000),(29,0,'2025-07-05 05:00:00','Enero','130652','Venta al crédito según Fact. 814',814,120000.0000,0.0000,0.0000),(30,0,'2025-07-04 05:00:00','Enero','1305','Venta al crédito según Fact. 815',815,110000.0000,0.0000,0.0000),(31,0,'2025-07-04 05:00:00','Enero','130558','Venta al crédito según Fact. 815',815,110000.0000,0.0000,0.0000),(32,0,'2025-07-09 05:00:00','Enero','1305','Pago de Facturas Nº 807',1021,0.0000,45000.0000,-45000.0000),(33,0,'2025-07-09 05:00:00','Enero','130558','Pago de Facturas Nº 807',1021,0.0000,45000.0000,-45000.0000),(34,0,'2025-07-09 05:00:00','Enero','1105','Pago de Facturas Nº 807',1021,45000.0000,0.0000,45000.0000),(35,0,'2025-07-09 05:00:00','Enero','1305','Pago de Facturas Nº 815',1021,0.0000,55000.0000,-100000.0000),(36,0,'2025-07-09 05:00:00','Enero','130558','Pago de Facturas Nº 815',1021,0.0000,55000.0000,-100000.0000),(37,0,'2025-07-09 05:00:00','Enero','1105','Pago de Facturas Nº 815',1021,55000.0000,0.0000,100000.0000),(38,0,'2025-07-09 05:00:00','Enero','1305','Pago de Facturas Nº 814',1022,0.0000,30000.0000,-130000.0000),(39,0,'2025-07-09 05:00:00','Enero','130652','Pago de Facturas Nº 814',1022,0.0000,30000.0000,-30000.0000),(40,0,'2025-07-09 05:00:00','Enero','1105','Pago de Facturas Nº 814',1022,30000.0000,0.0000,130000.0000),(41,0,'2025-07-22 05:00:00','Enero','1305','Pago de Facturas Nº 790',1023,0.0000,48000.0000,-178000.0000),(42,0,'2025-07-22 05:00:00','Enero','130511','Pago de Facturas Nº 790',1023,0.0000,48000.0000,-48000.0000),(43,0,'2025-07-22 05:00:00','Enero','1105','Pago de Facturas Nº 790',1023,48000.0000,0.0000,178000.0000),(44,0,'2025-07-22 05:00:00','Enero','1305','Pago de Facturas Nº 805',1024,0.0000,45000.0000,-223000.0000),(45,0,'2025-07-22 05:00:00','Enero','130520','Pago de Facturas Nº 805',1024,0.0000,45000.0000,-45000.0000),(46,0,'2025-07-22 05:00:00','Enero','1105','Pago de Facturas Nº 805',1024,45000.0000,0.0000,223000.0000),(47,0,'2025-07-22 05:00:00','Enero','1305','Pago de Facturas Nº 799',1025,0.0000,43000.0000,-266000.0000),(48,0,'2025-07-22 05:00:00','Enero','130569','Pago de Facturas Nº 799',1025,0.0000,43000.0000,-43000.0000),(49,0,'2025-07-22 05:00:00','Enero','1105','Pago de Facturas Nº 799',1025,43000.0000,0.0000,266000.0000),(50,0,'2025-07-22 05:00:00','Enero','1305','Pago de Facturas Nº 798',1026,0.0000,140000.0000,-406000.0000),(51,0,'2025-07-22 05:00:00','Enero','130676','Pago de Facturas Nº 798',1026,0.0000,140000.0000,-140000.0000),(52,0,'2025-07-22 05:00:00','Enero','1105','Pago de Facturas Nº 798',1026,140000.0000,0.0000,406000.0000),(53,0,'2025-07-22 05:00:00','Enero','1305','Pago de Facturas Nº 811',1027,0.0000,70000.0000,-476000.0000),(54,0,'2025-07-22 05:00:00','Enero','130635','Pago de Facturas Nº 811',1027,0.0000,70000.0000,-70000.0000),(55,0,'2025-07-22 05:00:00','Enero','1105','Pago de Facturas Nº 811',1027,70000.0000,0.0000,476000.0000),(56,0,'2025-07-22 05:00:00','Enero','1305','Pago de Facturas Nº 791',1028,0.0000,35000.0000,-511000.0000),(57,0,'2025-07-22 05:00:00','Enero','130625','Pago de Facturas Nº 791',1028,0.0000,35000.0000,-35000.0000),(58,0,'2025-07-22 05:00:00','Enero','1105','Pago de Facturas Nº 791',1028,35000.0000,0.0000,511000.0000),(59,0,'2025-07-22 05:00:00','Enero','1305','Pago de Facturas Nº 806',1029,0.0000,35000.0000,-546000.0000),(60,0,'2025-07-22 05:00:00','Enero','130627','Pago de Facturas Nº 806',1029,0.0000,35000.0000,-65000.0000),(61,0,'2025-07-22 05:00:00','Enero','1105','Pago de Facturas Nº 806',1029,35000.0000,0.0000,546000.0000),(62,0,'2025-07-22 05:00:00','Enero','1305','Pago de Facturas Nº 795',1030,0.0000,60000.0000,-606000.0000),(63,0,'2025-07-22 05:00:00','Enero','130659','Pago de Facturas Nº 795',1030,0.0000,60000.0000,-60000.0000),(64,0,'2025-07-22 05:00:00','Enero','1105','Pago de Facturas Nº 795',1030,60000.0000,0.0000,606000.0000),(65,0,'2025-07-22 05:00:00','Enero','1305','Pago de Facturas Nº ',1031,0.0000,0.0000,-606000.0000),(66,0,'2025-07-22 05:00:00','Enero','130639','Pago de Facturas Nº ',1031,0.0000,0.0000,0.0000),(67,0,'2025-07-22 05:00:00','Enero','1105','Pago de Facturas Nº ',1031,0.0000,0.0000,606000.0000),(68,0,'2025-07-22 05:00:00','Enero','1305','Pago de Facturas Nº 772',1031,0.0000,50000.0000,-656000.0000),(69,0,'2025-07-22 05:00:00','Enero','130639','Pago de Facturas Nº 772',1031,0.0000,50000.0000,-50000.0000),(70,0,'2025-07-22 05:00:00','Enero','1105','Pago de Facturas Nº 772',1031,50000.0000,0.0000,656000.0000),(71,0,'2025-07-22 05:00:00','Enero','1305','Pago de Facturas Nº 772',1031,0.0000,0.0000,-656000.0000),(72,0,'2025-07-22 05:00:00','Enero','130639','Pago de Facturas Nº 772',1031,0.0000,0.0000,-50000.0000),(73,0,'2025-07-22 05:00:00','Enero','1105','Pago de Facturas Nº 772',1031,0.0000,0.0000,656000.0000),(74,0,'2025-07-22 05:00:00','Enero','1305','Pago de Facturas Nº 779',1032,0.0000,140000.0000,-796000.0000),(75,0,'2025-07-22 05:00:00','Enero','130552','Pago de Facturas Nº 779',1032,0.0000,140000.0000,-140000.0000),(76,0,'2025-07-22 05:00:00','Enero','1105','Pago de Facturas Nº 779',1032,140000.0000,0.0000,796000.0000),(77,0,'2025-07-11 05:00:00','Enero','1305','Venta al crédito según Fact. 816',816,25000.0000,0.0000,0.0000),(78,0,'2025-07-11 05:00:00','Enero','130593','Venta al crédito según Fact. 816',816,25000.0000,0.0000,0.0000),(79,0,'2025-07-10 05:00:00','Enero','1305','Venta al crédito según Fact. 817',817,130000.0000,0.0000,0.0000),(80,0,'2025-07-10 05:00:00','Enero','130540','Venta al crédito según Fact. 817',817,130000.0000,0.0000,0.0000),(81,0,'2025-07-24 05:00:00','Enero','1305','Venta al crédito según Fact. 818',818,120000.0000,0.0000,0.0000),(82,0,'2025-07-24 05:00:00','Enero','130504','Venta al crédito según Fact. 818',818,120000.0000,0.0000,0.0000),(83,0,'2025-07-25 05:00:00','Enero','1305','Venta al crédito según Fact. 819',819,60000.0000,0.0000,0.0000),(84,0,'2025-07-25 05:00:00','Enero','130677','Venta al crédito según Fact. 819',819,60000.0000,0.0000,0.0000),(85,0,'2025-07-28 05:00:00','Enero','1305','Pago de Facturas Nº 788',1033,0.0000,30000.0000,-30000.0000),(86,0,'2025-07-28 05:00:00','Enero','130583','Pago de Facturas Nº 788',1033,0.0000,30000.0000,-30000.0000),(87,0,'2025-07-28 05:00:00','Enero','1105','Pago de Facturas Nº 788',1033,30000.0000,0.0000,826000.0000),(88,0,'2025-07-28 05:00:00','Enero','1305','Pago de Facturas Nº 804',1034,0.0000,50000.0000,-80000.0000),(89,0,'2025-07-28 05:00:00','Enero','130602','Pago de Facturas Nº 804',1034,0.0000,50000.0000,-50000.0000),(90,0,'2025-07-28 05:00:00','Enero','1105','Pago de Facturas Nº 804',1034,50000.0000,0.0000,876000.0000),(91,0,'2025-07-28 05:00:00','Enero','1305','Pago de Facturas Nº 796',1035,0.0000,30000.0000,-110000.0000),(92,0,'2025-07-28 05:00:00','Enero','130675','Pago de Facturas Nº 796',1035,0.0000,30000.0000,-30000.0000),(93,0,'2025-07-28 05:00:00','Enero','1105','Pago de Facturas Nº 796',1035,30000.0000,0.0000,906000.0000),(94,0,'2025-07-28 05:00:00','Enero','1305','Pago de Facturas Nº ',1036,0.0000,0.0000,-110000.0000),(95,0,'2025-07-28 05:00:00','Enero','130512','Pago de Facturas Nº ',1036,0.0000,0.0000,0.0000),(96,0,'2025-07-28 05:00:00','Enero','1105','Pago de Facturas Nº ',1036,0.0000,0.0000,906000.0000),(97,0,'2025-07-28 05:00:00','Enero','1305','Pago de Facturas Nº 789',1036,0.0000,150000.0000,-260000.0000),(98,0,'2025-07-28 05:00:00','Enero','130512','Pago de Facturas Nº 789',1036,0.0000,150000.0000,-150000.0000),(99,0,'2025-07-28 05:00:00','Enero','1105','Pago de Facturas Nº 789',1036,150000.0000,0.0000,1056000.0000),(100,0,'2025-07-29 05:00:00','Enero','1305','Pago de Facturas Nº 788',1037,0.0000,95000.0000,-355000.0000),(101,0,'2025-07-29 05:00:00','Enero','130583','Pago de Facturas Nº 788',1037,0.0000,95000.0000,-125000.0000),(102,0,'2025-07-29 05:00:00','Enero','1105','Pago de Facturas Nº 788',1037,95000.0000,0.0000,1151000.0000),(103,0,'2025-07-30 05:00:00','Enero','1305','Venta al crédito según Fact. 820',820,70000.0000,0.0000,0.0000),(104,0,'2025-07-30 05:00:00','Enero','130632','Venta al crédito según Fact. 820',820,70000.0000,0.0000,0.0000),(105,0,'2025-07-30 05:00:00','Enero','1305','Venta al crédito según Fact. 821',821,35000.0000,0.0000,0.0000),(106,0,'2025-07-30 05:00:00','Enero','130554','Venta al crédito según Fact. 821',821,35000.0000,0.0000,0.0000),(107,0,'2025-08-04 05:00:00','Enero','1305','Pago de Facturas Nº 799',1038,0.0000,20000.0000,-20000.0000),(108,0,'2025-08-04 05:00:00','Enero','130569','Pago de Facturas Nº 799',1038,0.0000,20000.0000,-63000.0000),(109,0,'2025-08-04 05:00:00','Enero','1105','Pago de Facturas Nº 799',1038,20000.0000,0.0000,1171000.0000),(110,0,'2025-08-04 05:00:00','Enero','1305','Venta al crédito según Fact. 823',823,110000.0000,0.0000,0.0000),(111,0,'2025-08-04 05:00:00','Enero','130502','Venta al crédito según Fact. 823',823,110000.0000,0.0000,0.0000),(112,0,'2025-08-01 05:00:00','Enero','1305','Venta al crédito según Fact. 824',824,130000.0000,0.0000,0.0000),(113,0,'2025-08-01 05:00:00','Enero','130611','Venta al crédito según Fact. 824',824,130000.0000,0.0000,0.0000),(114,0,'2025-08-02 05:00:00','Enero','1305','Venta al crédito según Fact. 825',825,130000.0000,0.0000,0.0000),(115,0,'2025-08-02 05:00:00','Enero','130509','Venta al crédito según Fact. 825',825,130000.0000,0.0000,0.0000),(116,0,'2025-08-01 05:00:00','Enero','1305','Venta al crédito según Fact. 826',826,220000.0000,0.0000,0.0000),(117,0,'2025-08-01 05:00:00','Enero','130633','Venta al crédito según Fact. 826',826,220000.0000,0.0000,0.0000),(118,0,'2025-08-12 05:00:00','Enero','1305','Venta al crédito según Fact. 827',827,150000.0000,0.0000,0.0000),(119,0,'2025-08-12 05:00:00','Enero','130638','Venta al crédito según Fact. 827',827,150000.0000,0.0000,0.0000),(120,0,'2025-08-13 05:00:00','Enero','1105','Devolución x Venta Fact Vent Nº 824',0,0.0000,0.0000,1171000.0000),(121,0,'2025-08-13 05:00:00','Enero','1305','Anulación de Factura Nº 824',0,0.0000,0.0000,0.0000),(122,0,'2025-08-13 05:00:00','Enero','130611','Anulación de Factura Nº 824',0,0.0000,0.0000,0.0000),(123,0,'2025-08-02 05:00:00','Enero','1305','Venta al crédito según Fact. 828',828,140000.0000,0.0000,0.0000),(124,0,'2025-08-02 05:00:00','Enero','130611','Venta al crédito según Fact. 828',828,140000.0000,0.0000,0.0000),(125,0,'2025-08-08 05:00:00','Enero','1305','Venta al crédito según Fact. 829',829,240000.0000,0.0000,0.0000),(126,0,'2025-08-08 05:00:00','Enero','130503','Venta al crédito según Fact. 829',829,240000.0000,0.0000,0.0000),(127,0,'2025-08-04 05:00:00','Enero','1305','Venta al crédito según Fact. 830',830,120000.0000,0.0000,0.0000),(128,0,'2025-08-04 05:00:00','Enero','130603','Venta al crédito según Fact. 830',830,120000.0000,0.0000,0.0000),(129,0,'2025-08-12 05:00:00','Enero','1105','Venta al Contado según Fact. 831',831,50000.0000,0.0000,0.0000),(130,0,'2025-08-13 05:00:00','Enero','1305','Venta al crédito según Fact. 832',832,35000.0000,0.0000,0.0000),(131,0,'2025-08-13 05:00:00','Enero','130678','Venta al crédito según Fact. 832',832,35000.0000,0.0000,0.0000),(132,0,'2025-08-13 05:00:00','Enero','1305','Venta al crédito según Fact. 833',833,25000.0000,0.0000,0.0000),(133,0,'2025-08-13 05:00:00','Enero','130678','Venta al crédito según Fact. 833',833,25000.0000,0.0000,0.0000),(134,0,'2025-08-13 05:00:00','Enero','1305','Pago de Facturas Nº 827',1039,0.0000,50000.0000,-50000.0000),(135,0,'2025-08-13 05:00:00','Enero','130638','Pago de Facturas Nº 827',1039,0.0000,50000.0000,-50000.0000),(136,0,'2025-08-13 05:00:00','Enero','1105','Pago de Facturas Nº 827',1039,50000.0000,0.0000,50000.0000),(137,0,'2025-08-13 05:00:00','Enero','1305','Pago de Facturas Nº 822',1040,0.0000,100000.0000,-150000.0000),(138,0,'2025-08-13 05:00:00','Enero','130503','Pago de Facturas Nº 822',1040,0.0000,100000.0000,-100000.0000),(139,0,'2025-08-13 05:00:00','Enero','1105','Pago de Facturas Nº 822',1040,100000.0000,0.0000,150000.0000),(140,0,'2025-08-13 05:00:00','Enero','1305','Pago de Facturas Nº 822',1040,0.0000,0.0000,-150000.0000),(141,0,'2025-08-13 05:00:00','Enero','130503','Pago de Facturas Nº 822',1040,0.0000,0.0000,-100000.0000),(142,0,'2025-08-13 05:00:00','Enero','1105','Pago de Facturas Nº 822',1040,0.0000,0.0000,150000.0000),(143,0,'2025-08-13 05:00:00','Enero','1305','Pago de Facturas Nº 815',1041,0.0000,55000.0000,-205000.0000),(144,0,'2025-08-13 05:00:00','Enero','130558','Pago de Facturas Nº 815',1041,0.0000,55000.0000,-155000.0000),(145,0,'2025-08-13 05:00:00','Enero','1105','Pago de Facturas Nº 815',1041,55000.0000,0.0000,205000.0000),(146,0,'2025-08-13 05:00:00','Enero','1305','Pago de Facturas Nº 828',1042,0.0000,50000.0000,-255000.0000),(147,0,'2025-08-13 05:00:00','Enero','130611','Pago de Facturas Nº 828',1042,0.0000,50000.0000,-50000.0000),(148,0,'2025-08-13 05:00:00','Enero','1105','Pago de Facturas Nº 828',1042,50000.0000,0.0000,255000.0000),(149,0,'2025-08-13 05:00:00','Enero','1305','Pago de Facturas Nº 733',1043,0.0000,20000.0000,-275000.0000),(150,0,'2025-08-13 05:00:00','Enero','130639','Pago de Facturas Nº 733',1043,0.0000,20000.0000,-70000.0000),(151,0,'2025-08-13 05:00:00','Enero','1105','Pago de Facturas Nº 733',1043,20000.0000,0.0000,275000.0000),(152,0,'2025-08-13 05:00:00','Enero','1305','Pago de Facturas Nº 772',1043,0.0000,60000.0000,-335000.0000),(153,0,'2025-08-13 05:00:00','Enero','130639','Pago de Facturas Nº 772',1043,0.0000,60000.0000,-130000.0000),(154,0,'2025-08-13 05:00:00','Enero','1105','Pago de Facturas Nº 772',1043,60000.0000,0.0000,335000.0000),(155,0,'2025-08-13 05:00:00','Enero','1305','Pago de Facturas Nº 803',1043,0.0000,20000.0000,-355000.0000),(156,0,'2025-08-13 05:00:00','Enero','130639','Pago de Facturas Nº 803',1043,0.0000,20000.0000,-150000.0000),(157,0,'2025-08-13 05:00:00','Enero','1105','Pago de Facturas Nº 803',1043,20000.0000,0.0000,355000.0000),(158,0,'2025-08-13 05:00:00','Enero','1305','Venta al crédito según Fact. 834',834,65000.0000,0.0000,0.0000),(159,0,'2025-08-13 05:00:00','Enero','130558','Venta al crédito según Fact. 834',834,65000.0000,0.0000,0.0000),(160,0,'2025-08-14 05:00:00','Enero','1305','Pago de Facturas Nº 813',1044,0.0000,25000.0000,-25000.0000),(161,0,'2025-08-14 05:00:00','Enero','130593','Pago de Facturas Nº 813',1044,0.0000,25000.0000,-25000.0000),(162,0,'2025-08-14 05:00:00','Enero','1105','Pago de Facturas Nº 813',1044,25000.0000,0.0000,380000.0000),(163,0,'2025-08-14 05:00:00','Enero','1305','Pago de Facturas Nº 816',1044,0.0000,15000.0000,-40000.0000),(164,0,'2025-08-14 05:00:00','Enero','130593','Pago de Facturas Nº 816',1044,0.0000,15000.0000,-40000.0000),(165,0,'2025-08-14 05:00:00','Enero','1105','Pago de Facturas Nº 816',1044,15000.0000,0.0000,395000.0000),(166,0,'2025-08-15 05:00:00','Enero','1305','Pago de Facturas Nº 781',1045,0.0000,15000.0000,-55000.0000),(167,0,'2025-08-15 05:00:00','Enero','130637','Pago de Facturas Nº 781',1045,0.0000,15000.0000,-15000.0000),(168,0,'2025-08-15 05:00:00','Enero','1105','Pago de Facturas Nº 781',1045,15000.0000,0.0000,410000.0000),(169,0,'2025-08-15 05:00:00','Enero','1305','Pago de Facturas Nº 826',1046,0.0000,73000.0000,-128000.0000),(170,0,'2025-08-15 05:00:00','Enero','130633','Pago de Facturas Nº 826',1046,0.0000,73000.0000,-73000.0000),(171,0,'2025-08-15 05:00:00','Enero','1105','Pago de Facturas Nº 826',1046,73000.0000,0.0000,483000.0000),(172,0,'2025-08-15 05:00:00','Enero','1305','Pago de Facturas Nº 784',1047,0.0000,8000.0000,-136000.0000),(173,0,'2025-08-15 05:00:00','Enero','130540','Pago de Facturas Nº 784',1047,0.0000,8000.0000,-8000.0000),(174,0,'2025-08-15 05:00:00','Enero','1105','Pago de Facturas Nº 784',1047,8000.0000,0.0000,491000.0000),(175,0,'2025-08-15 05:00:00','Enero','1305','Pago de Facturas Nº 785',1047,0.0000,35000.0000,-171000.0000),(176,0,'2025-08-15 05:00:00','Enero','130540','Pago de Facturas Nº 785',1047,0.0000,35000.0000,-43000.0000),(177,0,'2025-08-15 05:00:00','Enero','1105','Pago de Facturas Nº 785',1047,35000.0000,0.0000,526000.0000),(178,0,'2025-08-15 05:00:00','Enero','1305','Pago de Facturas Nº 808',1047,0.0000,107000.0000,-278000.0000),(179,0,'2025-08-15 05:00:00','Enero','130540','Pago de Facturas Nº 808',1047,0.0000,107000.0000,-150000.0000),(180,0,'2025-08-15 05:00:00','Enero','1105','Pago de Facturas Nº 808',1047,107000.0000,0.0000,633000.0000),(181,0,'2025-08-15 05:00:00','Enero','1305','Pago de Facturas Nº 808',1047,0.0000,0.0000,-278000.0000),(182,0,'2025-08-15 05:00:00','Enero','130540','Pago de Facturas Nº 808',1047,0.0000,0.0000,-150000.0000),(183,0,'2025-08-15 05:00:00','Enero','1105','Pago de Facturas Nº 808',1047,0.0000,0.0000,633000.0000),(184,0,'2025-08-18 05:00:00','Enero','1305','Pago de Facturas Nº 769',1048,0.0000,70000.0000,-348000.0000),(185,0,'2025-08-18 05:00:00','Enero','130509','Pago de Facturas Nº 769',1048,0.0000,70000.0000,-70000.0000),(186,0,'2025-08-18 05:00:00','Enero','1105','Pago de Facturas Nº 769',1048,70000.0000,0.0000,703000.0000),(187,0,'2025-08-18 05:00:00','Enero','1305','Pago de Facturas Nº 801',1048,0.0000,30000.0000,-378000.0000),(188,0,'2025-08-18 05:00:00','Enero','130509','Pago de Facturas Nº 801',1048,0.0000,30000.0000,-100000.0000),(189,0,'2025-08-18 05:00:00','Enero','1105','Pago de Facturas Nº 801',1048,30000.0000,0.0000,733000.0000),(190,0,'2025-08-18 05:00:00','Enero','1305','Pago de Facturas Nº 801',1048,0.0000,0.0000,-378000.0000),(191,0,'2025-08-18 05:00:00','Enero','130509','Pago de Facturas Nº 801',1048,0.0000,0.0000,-100000.0000),(192,0,'2025-08-18 05:00:00','Enero','1105','Pago de Facturas Nº 801',1048,0.0000,0.0000,733000.0000),(193,0,'2025-08-18 05:00:00','Enero','1305','Pago de Facturas Nº 796',1049,0.0000,20000.0000,-398000.0000),(194,0,'2025-08-18 05:00:00','Enero','130675','Pago de Facturas Nº 796',1049,0.0000,20000.0000,-50000.0000),(195,0,'2025-08-18 05:00:00','Enero','1105','Pago de Facturas Nº 796',1049,20000.0000,0.0000,753000.0000),(196,0,'2025-08-20 05:00:00','Enero','1305','Pago de Facturas Nº 819',1050,0.0000,40000.0000,-438000.0000),(197,0,'2025-08-20 05:00:00','Enero','130677','Pago de Facturas Nº 819',1050,0.0000,40000.0000,-40000.0000),(198,0,'2025-08-20 05:00:00','Enero','1105','Pago de Facturas Nº 819',1050,40000.0000,0.0000,793000.0000),(199,0,'2025-08-20 05:00:00','Enero','1305','Pago de Facturas Nº 677',1051,0.0000,6000.0000,-444000.0000),(200,0,'2025-08-20 05:00:00','Enero','130517','Pago de Facturas Nº 677',1051,0.0000,6000.0000,-6000.0000),(201,0,'2025-08-20 05:00:00','Enero','1105','Pago de Facturas Nº 677',1051,6000.0000,0.0000,799000.0000),(202,0,'2025-08-20 05:00:00','Enero','1305','Pago de Facturas Nº 820',1052,0.0000,40000.0000,-484000.0000),(203,0,'2025-08-20 05:00:00','Enero','130632','Pago de Facturas Nº 820',1052,0.0000,40000.0000,-40000.0000),(204,0,'2025-08-20 05:00:00','Enero','1105','Pago de Facturas Nº 820',1052,40000.0000,0.0000,839000.0000),(205,0,'2025-08-26 05:00:00','Enero','1305','Pago de Facturas Nº 823',1053,0.0000,100000.0000,-584000.0000),(206,0,'2025-08-26 05:00:00','Enero','130502','Pago de Facturas Nº 823',1053,0.0000,100000.0000,-100000.0000),(207,0,'2025-08-26 05:00:00','Enero','1105','Pago de Facturas Nº 823',1053,100000.0000,0.0000,939000.0000),(208,0,'2025-08-26 05:00:00','Enero','1305','Pago de Facturas Nº 805',1054,0.0000,60000.0000,-644000.0000),(209,0,'2025-08-26 05:00:00','Enero','130520','Pago de Facturas Nº 805',1054,0.0000,60000.0000,-105000.0000),(210,0,'2025-08-26 05:00:00','Enero','1105','Pago de Facturas Nº 805',1054,60000.0000,0.0000,999000.0000),(211,0,'2025-08-26 05:00:00','Enero','1305','Pago de Facturas Nº 799',1055,0.0000,20000.0000,-664000.0000),(212,0,'2025-08-26 05:00:00','Enero','130569','Pago de Facturas Nº 799',1055,0.0000,20000.0000,-83000.0000),(213,0,'2025-08-26 05:00:00','Enero','1105','Pago de Facturas Nº 799',1055,20000.0000,0.0000,1019000.0000),(214,0,'2025-08-26 05:00:00','Enero','1305','Pago de Facturas Nº 791',1056,0.0000,75000.0000,-739000.0000),(215,0,'2025-08-26 05:00:00','Enero','130625','Pago de Facturas Nº 791',1056,0.0000,75000.0000,-110000.0000),(216,0,'2025-08-26 05:00:00','Enero','1105','Pago de Facturas Nº 791',1056,75000.0000,0.0000,1094000.0000),(217,0,'2025-09-02 05:00:00','Enero','1305','Pago de Facturas Nº 819',1057,0.0000,20000.0000,-759000.0000),(218,0,'2025-09-02 05:00:00','Enero','130677','Pago de Facturas Nº 819',1057,0.0000,20000.0000,-60000.0000),(219,0,'2025-09-02 05:00:00','Enero','1105','Pago de Facturas Nº 819',1057,20000.0000,0.0000,1114000.0000),(220,0,'2025-09-02 05:00:00','Enero','1305','Pago de Facturas Nº 826',1058,0.0000,73000.0000,-832000.0000),(221,0,'2025-09-02 05:00:00','Enero','130633','Pago de Facturas Nº 826',1058,0.0000,73000.0000,-146000.0000),(222,0,'2025-09-02 05:00:00','Enero','1105','Pago de Facturas Nº 826',1058,73000.0000,0.0000,1187000.0000),(223,0,'2025-08-23 05:00:00','Enero','1305','Venta al crédito según Fact. 835',835,130000.0000,0.0000,0.0000),(224,0,'2025-08-23 05:00:00','Enero','130511','Venta al crédito según Fact. 835',835,130000.0000,0.0000,0.0000),(225,0,'2025-08-23 05:00:00','Enero','1305','Pago de Facturas Nº 830',1059,0.0000,50000.0000,-50000.0000),(226,0,'2025-08-23 05:00:00','Enero','130603','Pago de Facturas Nº 830',1059,0.0000,50000.0000,-50000.0000),(227,0,'2025-08-23 05:00:00','Enero','1105','Pago de Facturas Nº 830',1059,50000.0000,0.0000,1237000.0000),(228,0,'2025-08-23 05:00:00','Enero','1305','Venta al crédito según Fact. 836',836,60000.0000,0.0000,0.0000),(229,0,'2025-08-23 05:00:00','Enero','130603','Venta al crédito según Fact. 836',836,60000.0000,0.0000,0.0000),(230,0,'2025-08-19 05:00:00','Enero','1305','Venta al crédito según Fact. 837',837,25000.0000,0.0000,0.0000),(231,0,'2025-08-19 05:00:00','Enero','130593','Venta al crédito según Fact. 837',837,25000.0000,0.0000,0.0000),(232,0,'2025-08-25 05:00:00','Enero','1305','Venta al crédito según Fact. 838',838,70000.0000,0.0000,0.0000),(233,0,'2025-08-25 05:00:00','Enero','130532','Venta al crédito según Fact. 838',838,70000.0000,0.0000,0.0000),(234,0,'2025-08-29 05:00:00','Enero','1305','Venta al crédito según Fact. 839',839,70000.0000,0.0000,0.0000),(235,0,'2025-08-29 05:00:00','Enero','130518','Venta al crédito según Fact. 839',839,70000.0000,0.0000,0.0000),(236,0,'2025-08-28 05:00:00','Enero','1305','Venta al crédito según Fact. 840',840,85000.0000,0.0000,0.0000),(237,0,'2025-08-28 05:00:00','Enero','130679','Venta al crédito según Fact. 840',840,85000.0000,0.0000,0.0000),(238,0,'2025-09-02 05:00:00','Enero','1305','Pago de Facturas Nº 828',1060,0.0000,85000.0000,-85000.0000),(239,0,'2025-09-02 05:00:00','Enero','130611','Pago de Facturas Nº 828',1060,0.0000,85000.0000,-135000.0000),(240,0,'2025-09-02 05:00:00','Enero','1105','Pago de Facturas Nº 828',1060,85000.0000,0.0000,1322000.0000),(241,0,'2025-09-04 05:00:00','Enero','1305','Pago de Facturas Nº 799',1061,0.0000,37000.0000,-122000.0000),(242,0,'2025-09-04 05:00:00','Enero','130569','Pago de Facturas Nº 799',1061,0.0000,37000.0000,-120000.0000),(243,0,'2025-09-04 05:00:00','Enero','1105','Pago de Facturas Nº 799',1061,37000.0000,0.0000,1359000.0000),(244,0,'2025-09-04 05:00:00','Enero','1305','Pago de Facturas Nº 820',1062,0.0000,30000.0000,-152000.0000),(245,0,'2025-09-04 05:00:00','Enero','130632','Pago de Facturas Nº 820',1062,0.0000,30000.0000,-70000.0000),(246,0,'2025-09-04 05:00:00','Enero','1105','Pago de Facturas Nº 820',1062,30000.0000,0.0000,1389000.0000),(247,0,'2025-09-04 05:00:00','Enero','1305','Pago de Facturas Nº 821',1063,0.0000,35000.0000,-187000.0000),(248,0,'2025-09-04 05:00:00','Enero','130554','Pago de Facturas Nº 821',1063,0.0000,35000.0000,-35000.0000),(249,0,'2025-09-04 05:00:00','Enero','1105','Pago de Facturas Nº 821',1063,35000.0000,0.0000,1424000.0000),(250,0,'2025-09-08 05:00:00','Enero','1305','Pago de Facturas Nº 814',1064,0.0000,50000.0000,-237000.0000),(251,0,'2025-09-08 05:00:00','Enero','130652','Pago de Facturas Nº 814',1064,0.0000,50000.0000,-80000.0000),(252,0,'2025-09-08 05:00:00','Enero','1105','Pago de Facturas Nº 814',1064,50000.0000,0.0000,1474000.0000),(253,0,'2025-09-08 05:00:00','Enero','1305','Pago de Facturas Nº 825',1065,0.0000,68100.0000,-305100.0000),(254,0,'2025-09-08 05:00:00','Enero','130509','Pago de Facturas Nº 825',1065,0.0000,68100.0000,-168100.0000),(255,0,'2025-09-08 05:00:00','Enero','1105','Pago de Facturas Nº 825',1065,68100.0000,0.0000,1542100.0000),(256,0,'0000-00-00 00:00:00','Enero','1305','Abono o pago a Facturas Nº 843',110501066,0.0000,50000.0000,0.0000),(257,0,'0000-00-00 00:00:00','Enero','130502','Abono o pago a Facturas Nº 843',110501066,0.0000,50000.0000,0.0000),(258,0,'2025-09-08 05:00:00','Enero','1305','Venta al crédito según Fact. 843',843,140000.0000,0.0000,0.0000),(259,0,'2025-09-08 05:00:00','Enero','130502','Venta al crédito según Fact. 843',843,140000.0000,0.0000,0.0000),(260,0,'2025-09-15 05:00:00','Enero','1305','Pago de Facturas Nº 827',1067,0.0000,100000.0000,-100000.0000),(261,0,'2025-09-15 05:00:00','Enero','130638','Pago de Facturas Nº 827',1067,0.0000,100000.0000,-150000.0000),(262,0,'2025-09-15 05:00:00','Enero','1105','Pago de Facturas Nº 827',1067,100000.0000,0.0000,1642100.0000),(263,0,'2025-09-15 05:00:00','Enero','1305','Pago de Facturas Nº 834',1068,0.0000,65000.0000,-165000.0000),(264,0,'2025-09-15 05:00:00','Enero','130558','Pago de Facturas Nº 834',1068,0.0000,65000.0000,-65000.0000),(265,0,'2025-09-15 05:00:00','Enero','1105','Pago de Facturas Nº 834',1068,65000.0000,0.0000,1707100.0000),(266,0,'2025-09-15 05:00:00','Enero','1305','Pago de Facturas Nº 809',1069,0.0000,30000.0000,-195000.0000),(267,0,'2025-09-15 05:00:00','Enero','130649','Pago de Facturas Nº 809',1069,0.0000,30000.0000,-30000.0000),(268,0,'2025-09-15 05:00:00','Enero','1105','Pago de Facturas Nº 809',1069,30000.0000,0.0000,1737100.0000),(269,0,'2025-09-15 05:00:00','Enero','1305','Pago de Facturas Nº 818',1070,0.0000,120000.0000,-315000.0000),(270,0,'2025-09-15 05:00:00','Enero','130504','Pago de Facturas Nº 818',1070,0.0000,120000.0000,-120000.0000),(271,0,'2025-09-15 05:00:00','Enero','1105','Pago de Facturas Nº 818',1070,120000.0000,0.0000,1857100.0000),(272,0,'2025-09-15 05:00:00','Enero','1305','Pago de Facturas Nº 828',1071,0.0000,5000.0000,-320000.0000),(273,0,'2025-09-15 05:00:00','Enero','130611','Pago de Facturas Nº 828',1071,0.0000,5000.0000,-140000.0000),(274,0,'2025-09-15 05:00:00','Enero','1105','Pago de Facturas Nº 828',1071,5000.0000,0.0000,1862100.0000),(275,0,'2025-09-15 05:00:00','Enero','1305','Pago de Facturas Nº 830',1072,0.0000,70000.0000,-390000.0000),(276,0,'2025-09-15 05:00:00','Enero','130603','Pago de Facturas Nº 830',1072,0.0000,70000.0000,-70000.0000),(277,0,'2025-09-15 05:00:00','Enero','1105','Pago de Facturas Nº 830',1072,70000.0000,0.0000,1932100.0000),(278,0,'2025-09-15 05:00:00','Enero','1305','Pago de Facturas Nº 836',1072,0.0000,35000.0000,-425000.0000),(279,0,'2025-09-15 05:00:00','Enero','130603','Pago de Facturas Nº 836',1072,0.0000,35000.0000,-105000.0000),(280,0,'2025-09-15 05:00:00','Enero','1105','Pago de Facturas Nº 836',1072,35000.0000,0.0000,1967100.0000),(281,0,'2025-09-16 05:00:00','Enero','1305','Pago de Facturas Nº 796',1073,0.0000,15000.0000,-440000.0000),(282,0,'2025-09-16 05:00:00','Enero','130675','Pago de Facturas Nº 796',1073,0.0000,15000.0000,-65000.0000),(283,0,'2025-09-16 05:00:00','Enero','1105','Pago de Facturas Nº 796',1073,15000.0000,0.0000,1982100.0000),(284,0,'2025-09-16 05:00:00','Enero','1305','Pago de Facturas Nº 780',1074,0.0000,35000.0000,-475000.0000),(285,0,'2025-09-16 05:00:00','Enero','130512','Pago de Facturas Nº 780',1074,0.0000,35000.0000,-185000.0000),(286,0,'2025-09-16 05:00:00','Enero','1105','Pago de Facturas Nº 780',1074,35000.0000,0.0000,2017100.0000),(287,0,'2025-09-16 05:00:00','Enero','1305','Pago de Facturas Nº 789',1074,0.0000,15000.0000,-490000.0000),(288,0,'2025-09-16 05:00:00','Enero','130512','Pago de Facturas Nº 789',1074,0.0000,15000.0000,-200000.0000),(289,0,'2025-09-16 05:00:00','Enero','1105','Pago de Facturas Nº 789',1074,15000.0000,0.0000,2032100.0000),(290,0,'2025-09-16 05:00:00','Enero','1305','Pago de Facturas Nº 803',1075,0.0000,101000.0000,-591000.0000),(291,0,'2025-09-16 05:00:00','Enero','130639','Pago de Facturas Nº 803',1075,0.0000,101000.0000,-251000.0000),(292,0,'2025-09-16 05:00:00','Enero','1105','Pago de Facturas Nº 803',1075,101000.0000,0.0000,2133100.0000),(293,0,'2025-09-16 05:00:00','Enero','1305','Pago de Facturas Nº 805',1076,0.0000,40000.0000,-631000.0000),(294,0,'2025-09-16 05:00:00','Enero','130520','Pago de Facturas Nº 805',1076,0.0000,40000.0000,-145000.0000),(295,0,'2025-09-16 05:00:00','Enero','1105','Pago de Facturas Nº 805',1076,40000.0000,0.0000,2173100.0000),(296,0,'2025-09-16 05:00:00','Enero','1305','Pago de Facturas Nº 754',1077,0.0000,50000.0000,-681000.0000),(297,0,'2025-09-16 05:00:00','Enero','130538','Pago de Facturas Nº 754',1077,0.0000,50000.0000,-50000.0000),(298,0,'2025-09-16 05:00:00','Enero','1105','Pago de Facturas Nº 754',1077,50000.0000,0.0000,2223100.0000),(299,0,'2025-09-16 05:00:00','Enero','1105','Abono - Pago de Fact.  Compro Egre Nº 129 Prov 220532',19,0.0000,470000.0000,1753100.0000),(300,0,'2025-09-23 05:00:00','Enero','1305','Pago de Facturas Nº 826',1078,0.0000,74000.0000,-755000.0000),(301,0,'2025-09-23 05:00:00','Enero','130633','Pago de Facturas Nº 826',1078,0.0000,74000.0000,-220000.0000),(302,0,'2025-09-23 05:00:00','Enero','1105','Pago de Facturas Nº 826',1078,74000.0000,0.0000,1827100.0000),(303,0,'2025-09-23 05:00:00','Enero','1305','Pago de Facturas Nº 838',1079,0.0000,70000.0000,-825000.0000),(304,0,'2025-09-23 05:00:00','Enero','130532','Pago de Facturas Nº 838',1079,0.0000,70000.0000,-70000.0000),(305,0,'2025-09-23 05:00:00','Enero','1105','Pago de Facturas Nº 838',1079,70000.0000,0.0000,1897100.0000),(306,0,'2025-09-23 05:00:00','Enero','1305','Pago de Facturas Nº 763',1080,0.0000,8000.0000,-833000.0000),(307,0,'2025-09-23 05:00:00','Enero','130510','Pago de Facturas Nº 763',1080,0.0000,8000.0000,-8000.0000),(308,0,'2025-09-23 05:00:00','Enero','1105','Pago de Facturas Nº 763',1080,8000.0000,0.0000,1905100.0000),(309,0,'2025-09-23 05:00:00','Enero','1305','Pago de Facturas Nº 816',1081,0.0000,10000.0000,-843000.0000),(310,0,'2025-09-23 05:00:00','Enero','130593','Pago de Facturas Nº 816',1081,0.0000,10000.0000,-10000.0000),(311,0,'2025-09-23 05:00:00','Enero','1105','Pago de Facturas Nº 816',1081,10000.0000,0.0000,1915100.0000),(312,0,'2025-09-23 05:00:00','Enero','1305','Pago de Facturas Nº 837',1081,0.0000,25000.0000,-868000.0000),(313,0,'2025-09-23 05:00:00','Enero','130593','Pago de Facturas Nº 837',1081,0.0000,25000.0000,-35000.0000),(314,0,'2025-09-23 05:00:00','Enero','1105','Pago de Facturas Nº 837',1081,25000.0000,0.0000,1940100.0000),(315,0,'2025-09-23 05:00:00','Enero','1305','Pago de Facturas Nº 842',1081,0.0000,15000.0000,-883000.0000),(316,0,'2025-09-23 05:00:00','Enero','130593','Pago de Facturas Nº 842',1081,0.0000,15000.0000,-50000.0000),(317,0,'2025-09-23 05:00:00','Enero','1105','Pago de Facturas Nº 842',1081,15000.0000,0.0000,1955100.0000),(318,0,'2025-09-23 05:00:00','Enero','1305','Pago de Facturas Nº 841',1082,0.0000,60000.0000,-943000.0000),(319,0,'2025-09-23 05:00:00','Enero','130514','Pago de Facturas Nº 841',1082,0.0000,60000.0000,-60000.0000),(320,0,'2025-09-23 05:00:00','Enero','1105','Pago de Facturas Nº 841',1082,60000.0000,0.0000,2015100.0000),(321,0,'2025-09-13 05:00:00','Enero','1305','Venta al crédito según Fact. 844',844,35000.0000,0.0000,0.0000),(322,0,'2025-09-13 05:00:00','Enero','130510','Venta al crédito según Fact. 844',844,35000.0000,0.0000,0.0000),(323,0,'2025-09-24 05:00:00','Enero','1305','Anulación de Factura Nº 844',0,0.0000,0.0000,0.0000),(324,0,'2025-09-24 05:00:00','Enero','130510','Anulación de Factura Nº 844',0,0.0000,0.0000,0.0000),(325,0,'2025-09-13 05:00:00','Enero','1305','Venta al crédito según Fact. 845',845,35000.0000,0.0000,0.0000),(326,0,'2025-09-13 05:00:00','Enero','130510','Venta al crédito según Fact. 845',845,35000.0000,0.0000,0.0000),(327,0,'2025-09-22 05:00:00','Enero','1305','Venta al crédito según Fact. 846',846,45000.0000,0.0000,0.0000),(328,0,'2025-09-22 05:00:00','Enero','130680','Venta al crédito según Fact. 846',846,45000.0000,0.0000,0.0000),(329,0,'2025-09-22 05:00:00','Enero','1305','Venta al crédito según Fact. 847',847,25000.0000,0.0000,0.0000),(330,0,'2025-09-22 05:00:00','Enero','130552','Venta al crédito según Fact. 847',847,25000.0000,0.0000,0.0000),(331,0,'2025-09-15 05:00:00','Enero','1305','Venta al crédito según Fact. 848',848,25000.0000,0.0000,0.0000),(332,0,'2025-09-15 05:00:00','Enero','130619','Venta al crédito según Fact. 848',848,25000.0000,0.0000,0.0000),(333,0,'2025-09-15 05:00:00','Enero','1305','Venta al crédito según Fact. 849',849,25000.0000,0.0000,0.0000),(334,0,'2025-09-15 05:00:00','Enero','130681','Venta al crédito según Fact. 849',849,25000.0000,0.0000,0.0000),(335,0,'2025-09-20 05:00:00','Enero','1305','Venta al crédito según Fact. 850',850,316000.0000,0.0000,0.0000),(336,0,'2025-09-20 05:00:00','Enero','130503','Venta al crédito según Fact. 850',850,316000.0000,0.0000,0.0000),(337,0,'2025-09-15 05:00:00','Enero','1105','Venta al Contado según Fact. 851',851,36000.0000,0.0000,0.0000),(338,0,'2025-09-20 05:00:00','Enero','1305','Venta al crédito según Fact. 852',852,140000.0000,0.0000,0.0000),(339,0,'2025-09-20 05:00:00','Enero','130646','Venta al crédito según Fact. 852',852,140000.0000,0.0000,0.0000),(340,0,'2025-09-20 05:00:00','Enero','1305','Venta al crédito según Fact. 853',853,140000.0000,0.0000,0.0000),(341,0,'2025-09-20 05:00:00','Enero','130647','Venta al crédito según Fact. 853',853,140000.0000,0.0000,0.0000),(342,0,'2025-09-15 05:00:00','Enero','1305','Venta al crédito según Fact. 854',854,140000.0000,0.0000,0.0000),(343,0,'2025-09-15 05:00:00','Enero','130677','Venta al crédito según Fact. 854',854,140000.0000,0.0000,0.0000),(344,0,'2025-09-24 05:00:00','Enero','1305','Venta al crédito según Fact. 855',855,200000.0000,0.0000,0.0000),(345,0,'2025-09-24 05:00:00','Enero','130682','Venta al crédito según Fact. 855',855,200000.0000,0.0000,0.0000),(346,0,'2025-09-16 05:00:00','Enero','1305','Venta al crédito según Fact. 856',856,140000.0000,0.0000,0.0000),(347,0,'2025-09-16 05:00:00','Enero','130533','Venta al crédito según Fact. 856',856,140000.0000,0.0000,0.0000),(348,0,'2025-09-23 05:00:00','Enero','1305','Venta al crédito según Fact. 857',857,130000.0000,0.0000,0.0000),(349,0,'2025-09-23 05:00:00','Enero','130635','Venta al crédito según Fact. 857',857,130000.0000,0.0000,0.0000),(350,0,'2025-09-24 05:00:00','Enero','1305','Pago de Facturas Nº 854',1083,0.0000,50000.0000,-50000.0000),(351,0,'2025-09-24 05:00:00','Enero','130677','Pago de Facturas Nº 854',1083,0.0000,50000.0000,-50000.0000),(352,0,'2025-09-24 05:00:00','Enero','1105','Pago de Facturas Nº 854',1083,50000.0000,0.0000,50000.0000),(353,0,'2025-10-02 05:00:00','Enero','1305','Pago de Facturas Nº 808',1084,0.0000,33000.0000,-83000.0000),(354,0,'2025-10-02 05:00:00','Enero','130540','Pago de Facturas Nº 808',1084,0.0000,33000.0000,-183000.0000),(355,0,'2025-10-02 05:00:00','Enero','1105','Pago de Facturas Nº 808',1084,33000.0000,0.0000,83000.0000),(356,0,'2025-10-02 05:00:00','Enero','1305','Pago de Facturas Nº 817',1084,0.0000,130000.0000,-213000.0000),(357,0,'2025-10-02 05:00:00','Enero','130540','Pago de Facturas Nº 817',1084,0.0000,130000.0000,-313000.0000),(358,0,'2025-10-02 05:00:00','Enero','1105','Pago de Facturas Nº 817',1084,130000.0000,0.0000,213000.0000),(359,0,'2025-10-02 05:00:00','Enero','1305','Pago de Facturas Nº 848',1085,0.0000,25000.0000,-238000.0000),(360,0,'2025-10-02 05:00:00','Enero','130619','Pago de Facturas Nº 848',1085,0.0000,25000.0000,-25000.0000),(361,0,'2025-10-02 05:00:00','Enero','1105','Pago de Facturas Nº 848',1085,25000.0000,0.0000,238000.0000),(362,0,'2025-09-25 05:00:00','Enero','1305','Venta al crédito según Fact. 858',858,120000.0000,0.0000,0.0000),(363,0,'2025-09-25 05:00:00','Enero','130617','Venta al crédito según Fact. 858',858,120000.0000,0.0000,0.0000),(364,0,'2025-09-15 05:00:00','Enero','1305','Venta al crédito según Fact. 859',859,110000.0000,0.0000,0.0000),(365,0,'2025-09-15 05:00:00','Enero','130516','Venta al crédito según Fact. 859',859,110000.0000,0.0000,0.0000),(366,0,'2025-09-15 05:00:00','Enero','1305','Venta al crédito según Fact. 860',860,80000.0000,0.0000,0.0000),(367,0,'2025-09-15 05:00:00','Enero','130518','Venta al crédito según Fact. 860',860,80000.0000,0.0000,0.0000),(368,0,'2025-10-02 05:00:00','Enero','1305','Pago de Facturas Nº 825',1086,0.0000,12900.0000,-12900.0000),(369,0,'2025-10-02 05:00:00','Enero','130509','Pago de Facturas Nº 825',1086,0.0000,12900.0000,-181000.0000),(370,0,'2025-10-02 05:00:00','Enero','1105','Pago de Facturas Nº 825',1086,12900.0000,0.0000,250900.0000),(371,0,'2025-10-02 05:00:00','Enero','1305','Pago de Facturas Nº 825',1087,0.0000,19000.0000,-31900.0000),(372,0,'2025-10-02 05:00:00','Enero','130509','Pago de Facturas Nº 825',1087,0.0000,19000.0000,-200000.0000),(373,0,'2025-10-02 05:00:00','Enero','1105','Pago de Facturas Nº 825',1087,19000.0000,0.0000,269900.0000),(374,0,'2025-10-03 05:00:00','Enero','1305','Pago de Facturas Nº 854',1088,0.0000,50000.0000,-81900.0000),(375,0,'2025-10-03 05:00:00','Enero','130677','Pago de Facturas Nº 854',1088,0.0000,50000.0000,-100000.0000),(376,0,'2025-10-03 05:00:00','Enero','1105','Pago de Facturas Nº 854',1088,50000.0000,0.0000,319900.0000),(377,0,'2025-10-03 05:00:00','Enero','1305','Pago de Facturas Nº 849',1089,0.0000,25000.0000,-106900.0000),(378,0,'2025-10-03 05:00:00','Enero','130681','Pago de Facturas Nº 849',1089,0.0000,25000.0000,-25000.0000),(379,0,'2025-10-03 05:00:00','Enero','1105','Pago de Facturas Nº 849',1089,25000.0000,0.0000,344900.0000),(380,0,'2025-10-03 05:00:00','Enero','1305','Pago de Facturas Nº 855',1090,0.0000,100000.0000,-206900.0000),(381,0,'2025-10-03 05:00:00','Enero','130682','Pago de Facturas Nº 855',1090,0.0000,100000.0000,-100000.0000),(382,0,'2025-10-03 05:00:00','Enero','1105','Pago de Facturas Nº 855',1090,100000.0000,0.0000,444900.0000),(383,0,'2025-10-03 05:00:00','Enero','1305','Pago de Facturas Nº 847',1091,0.0000,25000.0000,-231900.0000),(384,0,'2025-10-03 05:00:00','Enero','130552','Pago de Facturas Nº 847',1091,0.0000,25000.0000,-25000.0000),(385,0,'2025-10-03 05:00:00','Enero','1105','Pago de Facturas Nº 847',1091,25000.0000,0.0000,469900.0000),(386,0,'2025-10-03 05:00:00','Enero','1305','Pago de Facturas Nº 839',1092,0.0000,70000.0000,-301900.0000),(387,0,'2025-10-03 05:00:00','Enero','130518','Pago de Facturas Nº 839',1092,0.0000,70000.0000,-70000.0000),(388,0,'2025-10-03 05:00:00','Enero','1105','Pago de Facturas Nº 839',1092,70000.0000,0.0000,539900.0000),(389,0,'2025-10-03 05:00:00','Enero','1305','Pago de Facturas Nº 860',1092,0.0000,30000.0000,-331900.0000),(390,0,'2025-10-03 05:00:00','Enero','130518','Pago de Facturas Nº 860',1092,0.0000,30000.0000,-100000.0000),(391,0,'2025-10-03 05:00:00','Enero','1105','Pago de Facturas Nº 860',1092,30000.0000,0.0000,569900.0000),(392,0,'2025-10-04 05:00:00','Enero','1305','Pago de Facturas Nº 852',1093,0.0000,50000.0000,-381900.0000),(393,0,'2025-10-04 05:00:00','Enero','130646','Pago de Facturas Nº 852',1093,0.0000,50000.0000,-50000.0000),(394,0,'2025-10-04 05:00:00','Enero','1105','Pago de Facturas Nº 852',1093,50000.0000,0.0000,619900.0000),(395,0,'2025-10-07 05:00:00','Enero','1305','Pago de Facturas Nº 840',1094,0.0000,85000.0000,-466900.0000),(396,0,'2025-10-07 05:00:00','Enero','130679','Pago de Facturas Nº 840',1094,0.0000,85000.0000,-85000.0000),(397,0,'2025-10-07 05:00:00','Enero','1105','Pago de Facturas Nº 840',1094,85000.0000,0.0000,704900.0000),(398,0,'2025-10-07 05:00:00','Enero','1305','Pago de Facturas Nº 853',1095,0.0000,140000.0000,-606900.0000),(399,0,'2025-10-07 05:00:00','Enero','130647','Pago de Facturas Nº 853',1095,0.0000,140000.0000,-140000.0000),(400,0,'2025-10-07 05:00:00','Enero','1105','Pago de Facturas Nº 853',1095,140000.0000,0.0000,844900.0000),(401,0,'2025-10-08 05:00:00','Enero','1305','Pago de Facturas Nº 835',1096,0.0000,130000.0000,-736900.0000),(402,0,'2025-10-08 05:00:00','Enero','130511','Pago de Facturas Nº 835',1096,0.0000,130000.0000,-130000.0000),(403,0,'2025-10-08 05:00:00','Enero','1105','Pago de Facturas Nº 835',1096,130000.0000,0.0000,974900.0000),(404,0,'0000-00-00 00:00:00','Enero','1305','Abono o pago a Facturas Nº 864',110501097,0.0000,20000.0000,0.0000),(405,0,'0000-00-00 00:00:00','Enero','130568','Abono o pago a Facturas Nº 864',110501097,0.0000,20000.0000,0.0000),(406,0,'2025-10-16 05:00:00','Enero','1305','Pago de Facturas Nº 814',1098,0.0000,40000.0000,-40000.0000),(407,0,'2025-10-16 05:00:00','Enero','130652','Pago de Facturas Nº 814',1098,0.0000,40000.0000,-120000.0000),(408,0,'2025-10-16 05:00:00','Enero','1105','Pago de Facturas Nº 814',1098,40000.0000,0.0000,1014900.0000),(409,0,'2025-10-17 05:00:00','Enero','1305','Pago de Facturas Nº 836',1099,0.0000,25000.0000,-65000.0000),(410,0,'2025-10-17 05:00:00','Enero','130603','Pago de Facturas Nº 836',1099,0.0000,25000.0000,-130000.0000),(411,0,'2025-10-17 05:00:00','Enero','1105','Pago de Facturas Nº 836',1099,25000.0000,0.0000,1039900.0000),(412,0,'2025-10-17 05:00:00','Enero','1305','Pago de Facturas Nº 855',1100,0.0000,100000.0000,-165000.0000),(413,0,'2025-10-17 05:00:00','Enero','130682','Pago de Facturas Nº 855',1100,0.0000,100000.0000,-200000.0000),(414,0,'2025-10-17 05:00:00','Enero','1105','Pago de Facturas Nº 855',1100,100000.0000,0.0000,1139900.0000),(415,0,'2025-10-20 05:00:00','Enero','1305','Pago de Facturas Nº 854',1101,0.0000,40000.0000,-205000.0000),(416,0,'2025-10-20 05:00:00','Enero','130677','Pago de Facturas Nº 854',1101,0.0000,40000.0000,-140000.0000),(417,0,'2025-10-20 05:00:00','Enero','1105','Pago de Facturas Nº 854',1101,40000.0000,0.0000,1179900.0000),(418,0,'2025-10-20 05:00:00','Enero','1305','Pago de Facturas Nº 799',1102,0.0000,10000.0000,-215000.0000),(419,0,'2025-10-20 05:00:00','Enero','130569','Pago de Facturas Nº 799',1102,0.0000,10000.0000,-130000.0000),(420,0,'2025-10-20 05:00:00','Enero','1105','Pago de Facturas Nº 799',1102,10000.0000,0.0000,1189900.0000),(421,0,'2025-10-20 05:00:00','Enero','1305','Pago de Facturas Nº 846',1103,0.0000,35000.0000,-250000.0000),(422,0,'2025-10-20 05:00:00','Enero','130680','Pago de Facturas Nº 846',1103,0.0000,35000.0000,-35000.0000),(423,0,'2025-10-20 05:00:00','Enero','1105','Pago de Facturas Nº 846',1103,35000.0000,0.0000,1224900.0000),(424,0,'2025-10-20 05:00:00','Enero','1305','Pago de Facturas Nº 852',1104,0.0000,50000.0000,-300000.0000),(425,0,'2025-10-20 05:00:00','Enero','130646','Pago de Facturas Nº 852',1104,0.0000,50000.0000,-100000.0000),(426,0,'2025-10-20 05:00:00','Enero','1105','Pago de Facturas Nº 852',1104,50000.0000,0.0000,1274900.0000),(427,0,'2025-10-20 05:00:00','Enero','1305','Pago de Facturas Nº 823',1105,0.0000,10000.0000,-310000.0000),(428,0,'2025-10-20 05:00:00','Enero','130502','Pago de Facturas Nº 823',1105,0.0000,10000.0000,-10000.0000),(429,0,'2025-10-20 05:00:00','Enero','1105','Pago de Facturas Nº 823',1105,10000.0000,0.0000,1284900.0000),(430,0,'2025-10-20 05:00:00','Enero','1305','Pago de Facturas Nº 843',1105,0.0000,90000.0000,-400000.0000),(431,0,'2025-10-20 05:00:00','Enero','130502','Pago de Facturas Nº 843',1105,0.0000,90000.0000,-100000.0000),(432,0,'2025-10-20 05:00:00','Enero','1105','Pago de Facturas Nº 843',1105,90000.0000,0.0000,1374900.0000),(433,0,'2025-10-10 05:00:00','Enero','1305','Venta al crédito según Fact. 866',866,130000.0000,0.0000,0.0000),(434,0,'2025-10-10 05:00:00','Enero','130684','Venta al crédito según Fact. 866',866,130000.0000,0.0000,0.0000),(435,0,'2025-10-15 05:00:00','Enero','1305','Venta al crédito según Fact. 867',867,98900.0000,0.0000,0.0000),(436,0,'2025-10-15 05:00:00','Enero','130506','Venta al crédito según Fact. 867',867,98900.0000,0.0000,0.0000),(437,0,'2025-10-17 05:00:00','Enero','1305','Venta al crédito según Fact. 868',868,114900.0000,0.0000,0.0000),(438,0,'2025-10-17 05:00:00','Enero','130685','Venta al crédito según Fact. 868',868,114900.0000,0.0000,0.0000),(439,0,'2025-10-21 05:00:00','Enero','1305','Pago de Facturas Nº 866',1106,0.0000,50000.0000,-50000.0000),(440,0,'2025-10-21 05:00:00','Enero','130684','Pago de Facturas Nº 866',1106,0.0000,50000.0000,-50000.0000),(441,0,'2025-10-21 05:00:00','Enero','1105','Pago de Facturas Nº 866',1106,50000.0000,0.0000,1424900.0000);
/*!40000 ALTER TABLE `tblauxiliares` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tblbancos`
--

DROP TABLE IF EXISTS `tblbancos`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tblbancos` (
  `idBancos` int(11) NOT NULL,
  `FechaCreacion` datetime DEFAULT NULL,
  `NumCuenta` varchar(50) NOT NULL,
  `NomCuenta` varchar(45) NOT NULL,
  `Predeterminada` int(11) DEFAULT NULL,
  PRIMARY KEY (`idBancos`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tblbancos`
--

LOCK TABLES `tblbancos` WRITE;
/*!40000 ALTER TABLE `tblbancos` DISABLE KEYS */;
INSERT INTO `tblbancos` VALUES (1,'2024-08-30 10:22:00','111111111111111','Bancoolombia',1);
/*!40000 ALTER TABLE `tblbancos` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tblcategoria`
--

DROP TABLE IF EXISTS `tblcategoria`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tblcategoria` (
  `Categoria` varchar(100) DEFAULT NULL,
  `Id_Categoria` int(11) NOT NULL,
  PRIMARY KEY (`Id_Categoria`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tblcategoria`
--

LOCK TABLES `tblcategoria` WRITE;
/*!40000 ALTER TABLE `tblcategoria` DISABLE KEYS */;
INSERT INTO `tblcategoria` VALUES ('VARIOS',1);
/*!40000 ALTER TABLE `tblcategoria` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tblclientes`
--

DROP TABLE IF EXISTS `tblclientes`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tblclientes` (
  `CodigoClien` int(11) NOT NULL,
  `Razon_Social` varchar(80) DEFAULT NULL,
  `Nit` varchar(15) DEFAULT NULL,
  `Direcion_R` varchar(50) DEFAULT NULL,
  `Nombres` varchar(20) DEFAULT NULL,
  `Apellidos` varchar(20) DEFAULT NULL,
  `Identificacion` int(11) DEFAULT NULL,
  `Telefonos` varchar(100) DEFAULT NULL,
  `Direccion` varchar(50) DEFAULT NULL,
  `Nombre_C` varchar(50) DEFAULT NULL,
  `Apellidos_C` varchar(50) DEFAULT NULL,
  `Telefonos_C` varchar(50) DEFAULT NULL,
  `Direccion_C` varchar(50) DEFAULT NULL,
  `Cargo_C` varchar(50) DEFAULT NULL,
  `Fecha_Ingreso` datetime DEFAULT NULL,
  `CupoAutorizado` decimal(19,4) DEFAULT NULL,
  `Preciocosto` tinyint(1) DEFAULT NULL,
  `CodigoEmp` int(11) DEFAULT NULL,
  `FechaCumple` datetime DEFAULT NULL,
  `Email` varchar(50) DEFAULT NULL,
  `Whatsapp` varchar(25) NOT NULL,
  `Termino` int(11) DEFAULT NULL,
  `FacVenc` int(11) DEFAULT NULL,
  `FechaMod` datetime DEFAULT NULL,
  PRIMARY KEY (`CodigoClien`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tblclientes`
--

LOCK TABLES `tblclientes` WRITE;
/*!40000 ALTER TABLE `tblclientes` DISABLE KEYS */;
INSERT INTO `tblclientes` VALUES (130500,'VENTAS AL CONTADO','0','-','-','-',0,'0','-','-','-','0','-','-','2016-02-16 00:00:00',0.0000,0,0,NULL,'-','',0,0,'2025-07-01 21:25:08');
/*!40000 ALTER TABLE `tblclientes` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tblcomprobantediario`
--

DROP TABLE IF EXISTS `tblcomprobantediario`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tblcomprobantediario` (
  `N_Comprobante` int(11) NOT NULL DEFAULT 0,
  `Fecha` datetime DEFAULT NULL,
  `FacturaInicial` int(11) DEFAULT 0,
  `FacturaFinal` int(11) DEFAULT 0,
  `Acumulado` decimal(19,4) DEFAULT 0.0000,
  PRIMARY KEY (`N_Comprobante`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tblcomprobantediario`
--

LOCK TABLES `tblcomprobantediario` WRITE;
/*!40000 ALTER TABLE `tblcomprobantediario` DISABLE KEYS */;
/*!40000 ALTER TABLE `tblcomprobantediario` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tblconteodeinventario`
--

DROP TABLE IF EXISTS `tblconteodeinventario`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tblconteodeinventario` (
  `Cod_ConteoInv` int(11) NOT NULL,
  `FechaYHoraInicio` datetime DEFAULT NULL,
  `FechaYhoraFinalizar` datetime DEFAULT NULL,
  `EnConteo` tinyint(1) DEFAULT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tblconteodeinventario`
--

LOCK TABLES `tblconteodeinventario` WRITE;
/*!40000 ALTER TABLE `tblconteodeinventario` DISABLE KEYS */;
/*!40000 ALTER TABLE `tblconteodeinventario` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tblcontrolcaja`
--

DROP TABLE IF EXISTS `tblcontrolcaja`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tblcontrolcaja` (
  `Cod_ControlCaja` int(11) NOT NULL AUTO_INCREMENT,
  `Fecha` timestamp NOT NULL DEFAULT current_timestamp(),
  `ValorInicalCaja` decimal(19,4) DEFAULT 0.0000,
  `Villetes` decimal(19,4) DEFAULT 0.0000,
  `Monedas` decimal(19,4) DEFAULT 0.0000,
  `Cheques` decimal(19,4) DEFAULT 0.0000,
  `ValorTotal` decimal(19,4) DEFAULT 0.0000,
  `SaldoEnLibros` decimal(19,4) DEFAULT 0.0000,
  `Diferencia` decimal(19,4) DEFAULT 0.0000,
  `Base` decimal(19,4) DEFAULT 0.0000,
  `Estado` tinyint(1) DEFAULT NULL,
  `VContado` decimal(19,4) DEFAULT 0.0000,
  `VCredito` decimal(19,4) DEFAULT 0.0000,
  `Pagos` decimal(19,4) DEFAULT 0.0000,
  `Egresos` decimal(19,4) DEFAULT 0.0000,
  `VInventario` decimal(19,4) DEFAULT 0.0000,
  `Id_Usuario` int(11) DEFAULT NULL,
  `FechaCierre` datetime DEFAULT NULL,
  PRIMARY KEY (`Cod_ControlCaja`)
) ENGINE=InnoDB AUTO_INCREMENT=227 DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tblcontrolcaja`
--

LOCK TABLES `tblcontrolcaja` WRITE;
/*!40000 ALTER TABLE `tblcontrolcaja` DISABLE KEYS */;
INSERT INTO `tblcontrolcaja` VALUES (1,'2021-09-16 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(2,'2021-09-21 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(3,'2021-09-23 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(4,'2021-10-02 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(5,'2021-10-06 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(6,'2021-10-15 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(7,'2021-10-25 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(8,'2021-11-01 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(9,'2021-11-08 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(11,'2021-11-19 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(12,'2021-11-21 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(13,'2021-11-24 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(14,'2021-12-28 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(15,'2021-12-29 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(16,'2022-01-14 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(17,'2022-02-24 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(18,'2022-03-01 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(19,'2022-03-02 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(20,'2022-03-07 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(21,'2022-03-08 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(22,'2022-03-12 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(23,'2022-03-15 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(24,'2022-03-16 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(25,'2022-03-18 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(26,'2022-03-24 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(27,'2022-03-28 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(28,'2022-03-30 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(29,'2022-04-12 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(30,'2022-04-18 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(31,'2022-04-21 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(32,'2022-05-06 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(33,'2022-05-09 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(34,'2022-05-16 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(35,'2022-05-30 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(36,'2022-06-14 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(37,'2022-06-21 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(38,'2022-06-23 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(39,'2022-07-21 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(40,'2022-07-22 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(41,'2022-07-27 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(42,'2022-08-04 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(43,'2022-08-09 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(44,'2022-08-11 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(45,'2022-08-17 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(46,'2022-08-26 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(47,'2022-08-29 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(48,'2022-08-31 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(49,'2022-09-07 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(50,'2022-09-15 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(51,'2022-09-30 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(52,'2022-10-04 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(53,'2022-10-05 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(54,'2022-10-10 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(55,'2022-10-20 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(56,'2022-11-07 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(57,'2022-11-09 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(58,'2022-11-12 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(59,'2022-12-02 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(60,'2022-12-09 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(61,'2022-12-16 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(62,'2022-12-26 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(63,'2023-01-02 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(64,'2023-01-13 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(65,'2023-01-19 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(66,'2023-01-21 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(67,'2023-01-23 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(68,'2023-01-31 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(69,'2023-02-04 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(70,'2023-02-07 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(71,'2023-02-13 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(72,'2023-02-16 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(73,'2023-03-01 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(74,'2023-03-07 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(75,'2023-03-16 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(76,'2023-03-22 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(77,'2023-04-14 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(78,'2023-04-15 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(79,'2023-04-20 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(80,'2023-05-01 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(81,'2023-05-04 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(82,'2023-05-08 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(83,'2023-05-11 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(84,'2023-05-12 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(85,'2023-05-13 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(86,'2023-05-16 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(87,'2023-05-22 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(88,'2023-05-30 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(89,'2023-06-02 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(90,'2023-06-21 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(91,'2023-06-30 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(92,'2023-07-10 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(93,'2023-07-11 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(94,'2023-07-19 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(95,'2023-08-03 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(96,'2023-08-16 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(97,'2023-08-31 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(98,'2023-09-02 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(99,'2023-09-05 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(100,'2023-09-12 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(101,'2023-09-15 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(102,'2023-09-25 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(103,'2023-09-26 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(104,'2023-09-27 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(105,'2023-10-04 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(106,'2023-10-06 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(107,'2023-10-11 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(108,'2023-10-13 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(109,'2023-10-31 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(110,'2023-11-06 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(111,'2023-11-11 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(112,'2023-12-06 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(113,'2023-12-12 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(114,'2023-12-18 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(115,'2023-12-30 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(116,'2024-01-09 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(117,'2024-01-15 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(118,'2024-01-18 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(119,'2024-01-25 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(120,'2024-02-08 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(121,'2024-02-23 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(122,'2024-03-11 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(123,'2024-03-23 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(124,'2024-03-31 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(125,'2024-04-03 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(126,'2024-04-05 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(127,'2024-04-08 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(128,'2024-04-09 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(129,'2024-04-11 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(130,'2024-04-15 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(131,'2024-04-16 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(132,'2024-04-20 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(133,'2024-04-22 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(134,'2024-04-23 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(135,'2024-05-02 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(136,'2024-05-03 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(137,'2024-05-06 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(138,'2024-05-08 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(139,'2024-05-15 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(140,'2024-05-16 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(141,'2024-05-24 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(142,'2024-06-10 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(143,'2024-06-13 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(144,'2024-06-17 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(145,'2024-06-19 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(146,'2024-06-25 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(147,'2024-06-28 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(148,'2024-07-15 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(149,'2024-07-16 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(150,'2024-07-17 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(151,'2024-07-19 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(152,'2024-07-25 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(153,'2024-07-30 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(154,'2024-08-03 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(155,'2024-08-06 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(156,'2024-08-09 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(157,'2024-08-14 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(158,'2024-08-17 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(159,'2024-08-19 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(160,'2024-08-27 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(161,'2024-08-30 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(162,'2024-09-03 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(163,'2024-09-09 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(164,'2024-09-10 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(165,'2024-09-26 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(166,'2024-09-30 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(167,'2024-10-08 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(168,'2024-10-19 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(169,'2024-10-23 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(170,'2024-10-26 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(171,'2024-11-07 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(172,'2024-11-12 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(173,'2024-11-14 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(174,'2024-11-18 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(175,'2024-11-22 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(176,'2024-11-23 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(177,'2024-11-30 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(178,'2024-12-05 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(179,'2024-12-10 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(180,'2024-12-18 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(181,'2024-12-23 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(182,'2024-12-24 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(183,'2025-01-02 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(184,'2025-01-15 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(185,'2025-01-16 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(186,'2025-01-17 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(187,'2025-01-22 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(188,'2025-01-27 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(189,'2025-01-28 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(190,'2025-02-03 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(191,'2025-02-04 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(192,'2025-02-15 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(193,'2025-02-17 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(194,'2025-02-28 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(195,'2025-03-05 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(196,'2025-03-11 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(197,'2025-03-31 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(198,'2025-04-05 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(199,'2025-04-14 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(200,'2025-05-02 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(201,'2025-05-12 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(202,'2025-05-16 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(203,'2025-05-17 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(204,'2025-05-26 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(205,'2025-05-31 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(206,'2025-06-09 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(207,'2025-06-19 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(208,'2025-07-01 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(209,'2025-07-07 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(210,'2025-07-22 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(211,'2025-07-28 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(212,'2025-07-31 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(213,'2025-08-04 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(214,'2025-08-13 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(215,'2025-08-14 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(216,'2025-08-26 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(217,'2025-09-02 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(218,'2025-09-08 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(219,'2025-09-15 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(220,'2025-09-23 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(221,'2025-09-24 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(222,'2025-10-02 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(223,'2025-10-06 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(224,'2025-10-07 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(225,'2025-10-10 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL),(226,'2025-10-21 05:00:00',0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1,0.0000,0.0000,0.0000,0.0000,0.0000,NULL,NULL);
/*!40000 ALTER TABLE `tblcontrolcaja` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tblcotizaciones`
--

DROP TABLE IF EXISTS `tblcotizaciones`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tblcotizaciones` (
  `id_cotizacion` int(11) NOT NULL AUTO_INCREMENT,
  `codigo_cli` int(11) NOT NULL,
  `nombre_cliente` varchar(50) NOT NULL,
  `telefono_cli` varchar(25) NOT NULL,
  `fecha` date NOT NULL,
  `termino` int(11) NOT NULL,
  `dias` int(11) NOT NULL,
  `total_factura` double NOT NULL,
  `fecha_hora_creado` timestamp NOT NULL DEFAULT current_timestamp(),
  PRIMARY KEY (`id_cotizacion`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tblcotizaciones`
--

LOCK TABLES `tblcotizaciones` WRITE;
/*!40000 ALTER TABLE `tblcotizaciones` DISABLE KEYS */;
/*!40000 ALTER TABLE `tblcotizaciones` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tblcuadrecaja`
--

DROP TABLE IF EXISTS `tblcuadrecaja`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tblcuadrecaja` (
  `Id_CuadreCaja` int(11) NOT NULL AUTO_INCREMENT,
  `Fecha` datetime DEFAULT NULL,
  `FacturaN` int(11) DEFAULT 0,
  `TipoDoc` varchar(20) DEFAULT NULL,
  `Descripcion` varchar(80) DEFAULT NULL,
  `Valor` decimal(19,4) DEFAULT 0.0000,
  PRIMARY KEY (`Id_CuadreCaja`),
  KEY `Id_CuadreCaja` (`Id_CuadreCaja`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tblcuadrecaja`
--

LOCK TABLES `tblcuadrecaja` WRITE;
/*!40000 ALTER TABLE `tblcuadrecaja` DISABLE KEYS */;
/*!40000 ALTER TABLE `tblcuadrecaja` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tblcuentas`
--

DROP TABLE IF EXISTS `tblcuentas`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tblcuentas` (
  `N_Cuenta` varchar(20) NOT NULL,
  `Cuenta` varchar(50) DEFAULT NULL,
  `Parciales` decimal(19,4) DEFAULT NULL,
  `Debe` decimal(19,4) DEFAULT NULL,
  `Haber` decimal(19,4) DEFAULT NULL,
  `Saldo` decimal(19,4) DEFAULT NULL,
  `FechaMod` datetime DEFAULT NULL,
  PRIMARY KEY (`N_Cuenta`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tblcuentas`
--

LOCK TABLES `tblcuentas` WRITE;
/*!40000 ALTER TABLE `tblcuentas` DISABLE KEYS */;
INSERT INTO `tblcuentas` VALUES ('11','DISPONIBLE',0.0000,0.0000,0.0000,0.0000,NULL),('1105','CAJA',0.0000,0.0000,0.0000,0.0000,NULL),('110505','Caja General',0.0000,0.0000,0.0000,0.0000,NULL),('110510','CAJA MENOR',0.0000,0.0000,0.0000,0.0000,NULL),('1110','BANCOS',0.0000,0.0000,0.0000,0.0000,NULL),('1110001000000001','Cuenta para compras',0.0000,0.0000,0.0000,0.0000,NULL),('11100111111','Bancolombia',0.0000,0.0000,0.0000,0.0000,NULL),('1305','CLIENTES',0.0000,0.0000,0.0000,0.0000,NULL),('130500','VENTAS AL CONTADO',0.0000,0.0000,0.0000,0.0000,'2023-01-27 09:10:29'),('130502','Ana Lucia Mora',NULL,NULL,NULL,0.0000,'2025-10-20 17:33:22'),('130503','Beatriz Montes',NULL,NULL,NULL,556000.0000,'2025-10-22 10:59:53'),('130504','Melisa Lozano',NULL,NULL,NULL,0.0000,'2025-09-15 11:51:05'),('130506','Ruth Arrieta',NULL,NULL,NULL,98900.0000,'2025-10-22 10:59:53'),('130509','Marta Martínez ',NULL,NULL,NULL,30000.0000,'2025-10-22 10:59:53'),('130510','Leidy Modista',NULL,NULL,NULL,35000.0000,'2025-10-22 10:59:53'),('130511','Ana Liseth Casillas ',NULL,NULL,NULL,0.0000,'2025-10-08 21:18:48'),('130512','Saray Cuavas ',NULL,NULL,NULL,15000.0000,'2025-10-22 10:59:53'),('130513','Andrys Alcazar ',NULL,NULL,NULL,215000.0000,'2025-10-22 10:59:53'),('130514','Rosana Montiel ',NULL,NULL,NULL,0.0000,'2025-09-23 19:34:46'),('130516','Carmen Cecilia Martínez',NULL,NULL,NULL,110000.0000,'2025-10-22 10:59:53'),('130517','Carmen Rosa Martínez',NULL,NULL,NULL,0.0000,'2025-08-20 19:04:25'),('130518','Yineth Mercado',NULL,NULL,NULL,50000.0000,'2025-10-22 10:59:53'),('130520','Carolina Lozano',NULL,NULL,NULL,0.0000,'2025-09-16 10:59:17'),('130526','María José Marzola',NULL,NULL,NULL,0.0000,'2025-07-04 10:02:52'),('130529','Ana Luisa',NULL,NULL,NULL,70000.0000,'2025-10-22 10:59:53'),('130532','Karines Álvarez',NULL,NULL,NULL,0.0000,'2025-09-23 19:34:46'),('130533','Osirys Rivera',NULL,NULL,NULL,140000.0000,'2025-10-22 10:59:53'),('130538','Melisa Díaz',NULL,NULL,NULL,0.0000,'2025-09-16 10:59:17'),('130540','Alba Susana',NULL,NULL,NULL,0.0000,'2025-10-02 17:57:32'),('130552','Yonis Guerra',NULL,NULL,NULL,0.0000,'2025-10-03 20:02:04'),('130554','Rafaela Rivera',NULL,NULL,NULL,0.0000,'2025-09-04 13:18:33'),('130558','Ceida Manzano',NULL,NULL,NULL,0.0000,'2025-09-15 11:51:05'),('130568','Carlos Mario Martinez',NULL,NULL,NULL,35000.0000,'2025-10-22 10:59:53'),('130569','Edelmira Parra',NULL,NULL,NULL,0.0000,'2025-10-20 17:33:22'),('130583','Karina cuavas ',NULL,NULL,NULL,0.0000,'2025-07-29 10:51:43'),('130587','Angie Amiga de Deya',NULL,NULL,NULL,20000.0000,'2025-10-22 10:59:53'),('130591','Sirley Ricardo ',NULL,NULL,NULL,15000.0000,'2025-10-22 10:59:53'),('130592','Enith Ricardo',NULL,NULL,NULL,20000.0000,'2025-10-22 10:59:53'),('130593','Lía Negra',NULL,NULL,NULL,10000.0000,'2025-10-22 10:59:53'),('130602','Keyla Muñoz',NULL,NULL,NULL,90000.0000,'2025-10-22 10:59:53'),('130603','Nelly Enfermera',NULL,NULL,NULL,0.0000,'2025-10-17 09:22:46'),('130611','Nathaly Colesper',NULL,NULL,NULL,0.0000,'2025-09-15 11:51:05'),('130617','Luz Angela Marla',NULL,NULL,NULL,260000.0000,'2025-10-22 10:59:53'),('130619','Robert José Muñoz',NULL,NULL,NULL,0.0000,'2025-10-02 18:09:21'),('130625','Mariana Prima',NULL,NULL,NULL,0.0000,'2025-08-26 18:40:56'),('130626','Mayuris Jirleza',NULL,NULL,NULL,25000.0000,'2025-10-22 10:59:53'),('130627','Paulina Mercado',NULL,NULL,NULL,0.0000,'2025-07-22 16:58:55'),('130632','Enelvis Romero Esso',NULL,NULL,NULL,0.0000,'2025-09-04 13:18:33'),('130633','Darcy Melisa Diaz',NULL,NULL,NULL,0.0000,'2025-09-23 19:34:46'),('130635','Juan Carlos Muñoz',NULL,NULL,NULL,130000.0000,'2025-10-22 10:59:53'),('130637','Isabel Clinica Jerusalén ',NULL,NULL,NULL,0.0000,'2025-08-15 10:36:52'),('130638','Albert Tejada',NULL,NULL,NULL,0.0000,'2025-09-15 11:51:04'),('130639','Valentina Colesper',NULL,NULL,NULL,19000.0000,'2025-10-22 10:59:53'),('130646','Rubeiro Cindy ',NULL,NULL,NULL,40000.0000,'2025-10-22 10:59:53'),('130647','Sofia Iglesia',NULL,NULL,NULL,0.0000,'2025-10-07 21:19:03'),('130649','Elizabet Elida',NULL,NULL,NULL,110000.0000,'2025-10-22 10:59:53'),('130652','Darina Vecina frente',NULL,NULL,NULL,0.0000,'2025-10-16 10:59:27'),('130657','Ximena Diaz ',NULL,NULL,NULL,30000.0000,'2025-10-22 10:59:53'),('130659','Sindy  Tenorio ',NULL,NULL,NULL,0.0000,'2025-07-22 16:58:55'),('130666','Lilibeth pulseras',NULL,NULL,NULL,20000.0000,'2025-10-22 10:59:53'),('130671','Doris mamá de Ludis',NULL,NULL,NULL,15000.0000,'2025-10-22 10:59:53'),('130672','Carlos Herrera',NULL,NULL,NULL,0.0000,'2025-07-04 10:02:52'),('130673','Yeira Vecina',NULL,NULL,NULL,0.0000,'2025-07-05 13:18:02'),('130675','Rafael Mendez',NULL,NULL,NULL,0.0000,'2025-09-16 10:59:17'),('130676','Jose Lozano',NULL,NULL,NULL,0.0000,'2025-07-22 16:58:55'),('130677','Aury Acosta',NULL,NULL,NULL,0.0000,'2025-10-20 17:33:22'),('130678','LUIS FERNANDO MARTINEZ',NULL,NULL,NULL,60000.0000,'2025-10-22 10:59:53'),('130679','Dormelina Montalvo',NULL,NULL,NULL,0.0000,'2025-10-07 21:15:56'),('130680','Nellys Barrera',NULL,NULL,NULL,10000.0000,'2025-10-22 10:59:53'),('130681','Lili Verona Cuavas',NULL,NULL,NULL,0.0000,'2025-10-03 20:02:04'),('130682','Wendy Madrid',NULL,NULL,NULL,0.0000,'2025-10-17 09:22:46'),('130683','Mary Carlos Mario ',NULL,NULL,NULL,35000.0000,'2025-10-22 10:59:53'),('130684',' Ived Florez ',NULL,NULL,NULL,80000.0000,'2025-10-22 10:59:53'),('130685','Mayra candelaria',NULL,NULL,NULL,114900.0000,'2025-10-22 10:59:53'),('1355','ANTICIPO DE IMPUESTOS',0.0000,0.0000,0.0000,0.0000,NULL),('135515','Retención en la Fuente',0.0000,0.0000,0.0000,0.0000,NULL),('1365','CUENTAS X COBRAR A TRABAJADORES',0.0000,0.0000,0.0000,0.0000,NULL),('1435','MERCANCIA NO FABRICADA X LA EMPRESA',0.0000,0.0000,0.0000,0.0000,NULL),('2','provedores',0.0000,0.0000,0.0000,0.0000,NULL),('2205','PROVEEDORES NACIONALES',0.0000,0.0000,0.0000,0.0000,NULL),('220500','COMPRAS AL CONTADO',0.0000,0.0000,0.0000,0.0000,'2018-11-28 14:48:25'),('2408','IMPUESTO SOBRE LAS VENTAS X PAGAR',0.0000,0.0000,0.0000,0.0000,NULL),('3115','APORTES SOCIALES',0.0000,0.0000,0.0000,0.0000,NULL),('4135','COMERCIO AL POR MAYOR Y AL POR MENOR',0.0000,0.0000,0.0000,0.0000,NULL),('4175','Devoluciones en Ventas',0.0000,0.0000,0.0000,0.0000,NULL),('4201','INGRESOS NO OPERACIONALES',0.0000,0.0000,0.0000,0.0000,NULL),('4210','FINANCIEROS',0.0000,0.0000,0.0000,0.0000,NULL),('4295','DIVERSOS',0.0000,0.0000,0.0000,0.0000,NULL),('429553','Sobrante en Caja',0.0000,0.0000,0.0000,0.0000,NULL),('4705','Devolucion en Compras',0.0000,0.0000,0.0000,0.0000,NULL),('5','GASTOS',0.0000,0.0000,0.0000,0.0000,NULL),('51','GASTOS OPERACIONALES DE ADMINISTRACION',0.0000,0.0000,0.0000,0.0000,NULL),('5105','Gastos de Personal',0.0000,0.0000,0.0000,0.0000,NULL),('510501','Gastos Fijos',0.0000,0.0000,0.0000,0.0000,NULL),('510595','OTROS',0.0000,0.0000,0.0000,0.0000,NULL),('5506','Liquidación Caja',0.0000,0.0000,0.0000,0.0000,NULL),('6135','COMERCIO AL POR MAYOR Y AL POR MENOR(Costo)',0.0000,0.0000,0.0000,0.0000,NULL);
/*!40000 ALTER TABLE `tblcuentas` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tbldatosempresa`
--

DROP TABLE IF EXISTS `tbldatosempresa`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tbldatosempresa` (
  `Id_Empresa` int(11) NOT NULL AUTO_INCREMENT,
  `Empresa` varchar(50) DEFAULT '-',
  `Propietario` varchar(50) DEFAULT NULL,
  `Telefono` varchar(50) DEFAULT '0',
  `Direccion` varchar(80) DEFAULT '-',
  `Nit` varchar(50) DEFAULT '0',
  `Detalle` text DEFAULT '-',
  `AgentesRet` varchar(2) DEFAULT 'No',
  `Resolucion` varchar(20) DEFAULT '-',
  `FechaR` timestamp NOT NULL DEFAULT current_timestamp(),
  `Rango` varchar(20) DEFAULT '0',
  `Rango2` varchar(20) DEFAULT NULL,
  `vs` varchar(50) DEFAULT NULL,
  `Porcentajes` varchar(2) DEFAULT NULL,
  `Regimen` varchar(15) DEFAULT 'Común',
  `CajaRegistradora` varchar(50) DEFAULT NULL,
  `Configuracion` varchar(50) DEFAULT NULL,
  `IniciarFacturaEn` int(11) DEFAULT 0,
  `Caja` int(11) DEFAULT 0,
  `IvaIncluido` tinyint(1) DEFAULT NULL,
  `Prefijo` varchar(4) DEFAULT NULL,
  `Status` int(11) DEFAULT 1,
  `email` varchar(100) DEFAULT NULL,
  `api_token` text DEFAULT NULL,
  PRIMARY KEY (`Id_Empresa`),
  KEY `Id_Empresa` (`Id_Empresa`)
) ENGINE=MyISAM AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tbldatosempresa`
--

LOCK TABLES `tbldatosempresa` WRITE;
/*!40000 ALTER TABLE `tbldatosempresa` DISABLE KEYS */;
INSERT INTO `tbldatosempresa` VALUES (1,'NOMBRE DE LA EMPRESA','Propietario','0000000','Direcci├│n','000000000-0','Detalle del negocio','No','No requerida','2019-11-08 10:00:00','1','20000','9','No','Simplificado','No','  1 4',1,1,0,NULL,1,'correo@empresa.com',NULL);
/*!40000 ALTER TABLE `tbldatosempresa` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tbldetalle_pedido`
--

DROP TABLE IF EXISTS `tbldetalle_pedido`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tbldetalle_pedido` (
  `Id_DetallePedido` int(11) NOT NULL AUTO_INCREMENT,
  `Pedido_N` int(11) DEFAULT NULL,
  `Items` int(11) DEFAULT NULL,
  `Cantidad` float DEFAULT NULL,
  `PrecioC` decimal(19,4) DEFAULT NULL,
  `PrecioV` decimal(19,4) DEFAULT NULL,
  `Impuesto` decimal(19,4) DEFAULT NULL,
  `Subtotal` decimal(19,4) DEFAULT NULL,
  `Dev` float DEFAULT NULL,
  PRIMARY KEY (`Id_DetallePedido`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tbldetalle_pedido`
--

LOCK TABLES `tbldetalle_pedido` WRITE;
/*!40000 ALTER TABLE `tbldetalle_pedido` DISABLE KEYS */;
/*!40000 ALTER TABLE `tbldetalle_pedido` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tbldetalle_venta`
--

DROP TABLE IF EXISTS `tbldetalle_venta`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tbldetalle_venta` (
  `Id_DetalleVenta` int(11) NOT NULL AUTO_INCREMENT,
  `Factura_N` int(11) DEFAULT 0,
  `Factura_NTemp` varchar(100) DEFAULT NULL,
  `Items` int(11) DEFAULT 0,
  `DescripcionTemp` varchar(100) DEFAULT NULL,
  `Cantidad` float DEFAULT 0,
  `PrecioC` decimal(19,4) DEFAULT 0.0000,
  `PrecioV` decimal(19,4) DEFAULT 0.0000,
  `Impuesto` decimal(19,4) DEFAULT 0.0000,
  `Subtotal` decimal(19,4) DEFAULT 0.0000,
  `Dev` float DEFAULT 0,
  `IVA` int(11) DEFAULT NULL,
  `Descuento` decimal(19,4) DEFAULT 0.0000,
  `Entregado` varchar(1) DEFAULT 'S',
  `Cant_Mod` int(11) DEFAULT NULL,
  `PrecioV_Mod` decimal(19,4) DEFAULT 0.0000,
  `PrecioC_Mod` decimal(19,4) DEFAULT 0.0000,
  `fecha_entrega` date DEFAULT NULL,
  PRIMARY KEY (`Id_DetalleVenta`),
  KEY `Id_DetalleVenta` (`Id_DetalleVenta`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tbldetalle_venta`
--

LOCK TABLES `tbldetalle_venta` WRITE;
/*!40000 ALTER TABLE `tbldetalle_venta` DISABLE KEYS */;
/*!40000 ALTER TABLE `tbldetalle_venta` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tbldetallecomprobantediario`
--

DROP TABLE IF EXISTS `tbldetallecomprobantediario`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tbldetallecomprobantediario` (
  `Id_DetalleComproDiario` int(11) NOT NULL AUTO_INCREMENT,
  `N_Comprobante` int(11) DEFAULT 0,
  `Concepto` varchar(50) DEFAULT NULL,
  `Valor` decimal(19,4) DEFAULT 0.0000,
  PRIMARY KEY (`Id_DetalleComproDiario`),
  KEY `Id_DetalleComproDiario` (`Id_DetalleComproDiario`)
) ENGINE=MyISAM AUTO_INCREMENT=10 DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tbldetallecomprobantediario`
--

LOCK TABLES `tbldetallecomprobantediario` WRITE;
/*!40000 ALTER TABLE `tbldetallecomprobantediario` DISABLE KEYS */;
INSERT INTO `tbldetallecomprobantediario` VALUES (1,1,'Ventas Grabadas al 16%',0.0000),(2,1,'IVA 16%',0.0000),(3,1,'Ventas Excluidas',1520550.0000),(4,1,'Total',1520550.0000),(5,1,'Ventas Crédito',1520550.0000),(6,1,'Ventas Contado',0.0000),(7,1,'Abonos y pagos',44900.0000),(8,1,'Gastos',0.0000),(9,1,'Acumulado',2876700.0000);
/*!40000 ALTER TABLE `tbldetallecomprobantediario` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tbldetalleorden`
--

DROP TABLE IF EXISTS `tbldetalleorden`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tbldetalleorden` (
  `Id_Detalle_Orden` int(11) NOT NULL AUTO_INCREMENT,
  `Orden_N` int(11) DEFAULT 0,
  `Items` int(11) DEFAULT 0,
  `Descripcion` varchar(200) DEFAULT NULL,
  `Cantidad` double DEFAULT 0,
  `ValorUnit` decimal(19,4) DEFAULT 0.0000,
  `ValorTotal` decimal(19,4) DEFAULT 0.0000,
  PRIMARY KEY (`Id_Detalle_Orden`),
  KEY `Id_Detalle_Orden` (`Id_Detalle_Orden`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tbldetalleorden`
--

LOCK TABLES `tbldetalleorden` WRITE;
/*!40000 ALTER TABLE `tbldetalleorden` DISABLE KEYS */;
/*!40000 ALTER TABLE `tbldetalleorden` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tbldetalleorden2`
--

DROP TABLE IF EXISTS `tbldetalleorden2`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tbldetalleorden2` (
  `Cod_DetalleOrden2` int(11) NOT NULL AUTO_INCREMENT,
  `Orden_N` int(11) DEFAULT 0,
  `Items` int(11) DEFAULT 0,
  `Id_Articulos` double DEFAULT 0,
  `Cantidad` int(11) DEFAULT 0,
  `valorUnit` decimal(19,4) DEFAULT 0.0000,
  `Subtotal` decimal(19,4) DEFAULT 0.0000,
  PRIMARY KEY (`Cod_DetalleOrden2`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tbldetalleorden2`
--

LOCK TABLES `tbldetalleorden2` WRITE;
/*!40000 ALTER TABLE `tbldetalleorden2` DISABLE KEYS */;
/*!40000 ALTER TABLE `tbldetalleorden2` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tbldetalleorden3`
--

DROP TABLE IF EXISTS `tbldetalleorden3`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tbldetalleorden3` (
  `Id_DetalleOrden3` int(11) NOT NULL AUTO_INCREMENT,
  `Orden_N` int(11) DEFAULT 0,
  `Items` int(11) DEFAULT 0,
  `CodigoEmp` int(11) DEFAULT 0,
  `Porcentaje` int(11) DEFAULT 0,
  `Utilidad` decimal(19,4) DEFAULT 0.0000,
  PRIMARY KEY (`Id_DetalleOrden3`),
  KEY `Id_DetalleOrden3` (`Id_DetalleOrden3`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tbldetalleorden3`
--

LOCK TABLES `tbldetalleorden3` WRITE;
/*!40000 ALTER TABLE `tbldetalleorden3` DISABLE KEYS */;
/*!40000 ALTER TABLE `tbldetalleorden3` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tbldetalleplansepare`
--

DROP TABLE IF EXISTS `tbldetalleplansepare`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tbldetalleplansepare` (
  `Id_DetallePlanSepare` int(11) NOT NULL AUTO_INCREMENT,
  `Id_PlanSepare` int(11) DEFAULT 0,
  `Id_Producto` int(11) DEFAULT 0,
  `Cantidad` int(11) DEFAULT 0,
  `Valor` decimal(19,4) DEFAULT 0.0000,
  `PCosto` decimal(19,4) DEFAULT 0.0000,
  `Subtotal` decimal(19,4) DEFAULT 0.0000,
  PRIMARY KEY (`Id_DetallePlanSepare`),
  KEY `Id_DetallePlanSepare` (`Id_DetallePlanSepare`),
  KEY `Id_PlanSepare` (`Id_PlanSepare`),
  KEY `Id_Producto` (`Id_Producto`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tbldetalleplansepare`
--

LOCK TABLES `tbldetalleplansepare` WRITE;
/*!40000 ALTER TABLE `tbldetalleplansepare` DISABLE KEYS */;
/*!40000 ALTER TABLE `tbldetalleplansepare` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tbldevolucion_ventas`
--

DROP TABLE IF EXISTS `tbldevolucion_ventas`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tbldevolucion_ventas` (
  `IdDevolVent` int(11) NOT NULL AUTO_INCREMENT,
  `Id_DetalleVenta` int(11) NOT NULL,
  `valor_dev` double NOT NULL,
  `caja` varchar(1) NOT NULL,
  `fecha_fact` date NOT NULL,
  `fecha_mod` datetime NOT NULL,
  PRIMARY KEY (`IdDevolVent`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tbldevolucion_ventas`
--

LOCK TABLES `tbldevolucion_ventas` WRITE;
/*!40000 ALTER TABLE `tbldevolucion_ventas` DISABLE KEYS */;
/*!40000 ALTER TABLE `tbldevolucion_ventas` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tbldocumentos`
--

DROP TABLE IF EXISTS `tbldocumentos`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tbldocumentos` (
  `Id_Documentos` int(11) NOT NULL DEFAULT 0,
  `N_Documento` int(11) DEFAULT 0,
  `Tipo_Documento` varchar(15) DEFAULT 'Crédito',
  `Descripcion` varchar(150) DEFAULT '-',
  `Fecha` timestamp NOT NULL DEFAULT current_timestamp(),
  `Valor` decimal(19,4) DEFAULT 0.0000,
  `Estado` varchar(20) DEFAULT 'Abierto',
  `Cuenta` varchar(15) DEFAULT NULL,
  PRIMARY KEY (`Id_Documentos`),
  KEY `Id_Documentos` (`Id_Documentos`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tbldocumentos`
--

LOCK TABLES `tbldocumentos` WRITE;
/*!40000 ALTER TABLE `tbldocumentos` DISABLE KEYS */;
/*!40000 ALTER TABLE `tbldocumentos` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tblegresos`
--

DROP TABLE IF EXISTS `tblegresos`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tblegresos` (
  `Id_Egresos` int(11) NOT NULL AUTO_INCREMENT,
  `N_Comprobante` int(11) DEFAULT 0,
  `Fecha` timestamp NOT NULL DEFAULT current_timestamp(),
  `Orden` varchar(50) DEFAULT '-',
  `Concepto` varchar(90) DEFAULT NULL,
  `Suma` varchar(100) DEFAULT '-',
  `Valor` decimal(19,4) DEFAULT 0.0000,
  `Descuento` decimal(19,4) DEFAULT 0.0000,
  `Estado` varchar(15) DEFAULT NULL,
  `Cuentas` varchar(80) DEFAULT NULL,
  `FactN` varchar(15) DEFAULT NULL,
  `CodigoPro` int(11) DEFAULT 0,
  `NFacturaAnt` varchar(20) DEFAULT NULL,
  `ValorFact` decimal(19,4) DEFAULT 0.0000,
  `Saldoact` decimal(19,4) DEFAULT 0.0000,
  `Cedula` varchar(20) DEFAULT NULL,
  `TipoPago` int(11) DEFAULT NULL,
  PRIMARY KEY (`Id_Egresos`),
  KEY `Id_Egresos` (`Id_Egresos`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tblegresos`
--

LOCK TABLES `tblegresos` WRITE;
/*!40000 ALTER TABLE `tblegresos` DISABLE KEYS */;
/*!40000 ALTER TABLE `tblegresos` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tblempleados`
--

DROP TABLE IF EXISTS `tblempleados`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tblempleados` (
  `CodigoEmp` int(11) NOT NULL DEFAULT 0,
  `Nombres` varchar(50) DEFAULT '-',
  `Apellidos` varchar(50) DEFAULT '-',
  `Cedula` varchar(50) DEFAULT '-',
  `Telefono` varchar(50) DEFAULT '-',
  `Direccion` varchar(50) DEFAULT '-',
  `FechaIngr` timestamp NOT NULL DEFAULT current_timestamp(),
  `Cod_Entidad` int(11) DEFAULT 0,
  `Valor` decimal(19,4) DEFAULT 0.0000,
  `SueldoBasico` decimal(19,4) DEFAULT 0.0000,
  `Cargo` varchar(50) DEFAULT '-',
  `Pensión` decimal(19,4) DEFAULT 0.0000,
  `TipoEmpleado` int(11) DEFAULT 0,
  `Vinculado` varchar(2) DEFAULT NULL,
  `Id_Usuario` int(11) DEFAULT 0,
  PRIMARY KEY (`CodigoEmp`),
  KEY `Id_Usuario` (`Id_Usuario`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tblempleados`
--

LOCK TABLES `tblempleados` WRITE;
/*!40000 ALTER TABLE `tblempleados` DISABLE KEYS */;
INSERT INTO `tblempleados` VALUES (0,'No','Asignado','0','0','-','2014-08-26 05:00:00',0,0.0000,0.0000,'-',0.0000,0,'No',NULL);
/*!40000 ALTER TABLE `tblempleados` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tblentidades`
--

DROP TABLE IF EXISTS `tblentidades`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tblentidades` (
  `Id_Entidades` int(11) NOT NULL AUTO_INCREMENT,
  `Entidad` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`Id_Entidades`),
  KEY `Id_Entidades` (`Id_Entidades`)
) ENGINE=MyISAM AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tblentidades`
--

LOCK TABLES `tblentidades` WRITE;
/*!40000 ALTER TABLE `tblentidades` DISABLE KEYS */;
INSERT INTO `tblentidades` VALUES (1,'COOMEVA'),(2,'ISS'),(3,'SALUDCOOP'),(4,'NINGUNA');
/*!40000 ALTER TABLE `tblentidades` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tblentregaarticulos`
--

DROP TABLE IF EXISTS `tblentregaarticulos`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tblentregaarticulos` (
  `idEntregaArt` int(11) NOT NULL AUTO_INCREMENT,
  `Items` int(11) NOT NULL,
  `FechaEntrega` datetime DEFAULT NULL,
  `IDDetalleVentaArt` int(11) NOT NULL,
  `Concepto` varchar(45) NOT NULL,
  `Valido` tinyint(1) DEFAULT NULL,
  PRIMARY KEY (`idEntregaArt`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tblentregaarticulos`
--

LOCK TABLES `tblentregaarticulos` WRITE;
/*!40000 ALTER TABLE `tblentregaarticulos` DISABLE KEYS */;
/*!40000 ALTER TABLE `tblentregaarticulos` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tblfacturasanteriores`
--

DROP TABLE IF EXISTS `tblfacturasanteriores`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tblfacturasanteriores` (
  `ID_FactAnteriores` int(11) NOT NULL AUTO_INCREMENT,
  `FacturaN` varchar(50) DEFAULT NULL,
  `Fecha` datetime DEFAULT NULL,
  `Dias` int(11) DEFAULT NULL,
  `Valor` decimal(19,4) DEFAULT NULL,
  `Saldo` decimal(19,4) DEFAULT NULL,
  `CodigoCli` int(11) DEFAULT NULL,
  `FechaMod` datetime DEFAULT NULL,
  PRIMARY KEY (`ID_FactAnteriores`),
  KEY `ID_FactAnteriores` (`ID_FactAnteriores`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tblfacturasanteriores`
--

LOCK TABLES `tblfacturasanteriores` WRITE;
/*!40000 ALTER TABLE `tblfacturasanteriores` DISABLE KEYS */;
/*!40000 ALTER TABLE `tblfacturasanteriores` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tblfacturasanterioresproveedor`
--

DROP TABLE IF EXISTS `tblfacturasanterioresproveedor`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tblfacturasanterioresproveedor` (
  `ID_FactAnterioresP` int(11) NOT NULL AUTO_INCREMENT,
  `FacturaN` varchar(50) DEFAULT NULL,
  `Fecha` datetime DEFAULT NULL,
  `Dias` int(11) DEFAULT 0,
  `Descuento` decimal(19,4) DEFAULT 0.0000,
  `IVA` decimal(19,4) DEFAULT 0.0000,
  `Subtotal` decimal(19,4) DEFAULT 0.0000,
  `Valor` decimal(19,4) DEFAULT 0.0000,
  `Saldo` decimal(19,4) DEFAULT 0.0000,
  `CodigoProv` int(11) DEFAULT 0,
  PRIMARY KEY (`ID_FactAnterioresP`),
  KEY `ID_FactAnterioresP` (`ID_FactAnterioresP`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tblfacturasanterioresproveedor`
--

LOCK TABLES `tblfacturasanterioresproveedor` WRITE;
/*!40000 ALTER TABLE `tblfacturasanterioresproveedor` DISABLE KEYS */;
/*!40000 ALTER TABLE `tblfacturasanterioresproveedor` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tblformulario`
--

DROP TABLE IF EXISTS `tblformulario`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tblformulario` (
  `Id_form` int(11) NOT NULL AUTO_INCREMENT,
  `Formulario` varchar(100) DEFAULT NULL,
  `PosX` float DEFAULT 0,
  `PoxY` float DEFAULT 0,
  `Alto` float DEFAULT 0,
  `Ancho` float DEFAULT 0,
  PRIMARY KEY (`Id_form`),
  KEY `Id_form` (`Id_form`)
) ENGINE=MyISAM AUTO_INCREMENT=99 DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tblformulario`
--

LOCK TABLES `tblformulario` WRITE;
/*!40000 ALTER TABLE `tblformulario` DISABLE KEYS */;
INSERT INTO `tblformulario` VALUES (1,'frmInventario',555,1155,12765,28185),(2,'frmIngresar_Producto',6525,1665,8700,8400),(3,'frmReferencia',3675,1545,3750,4770),(4,'frmCategoria',1500,1500,7620,6720),(5,'frmBuscarArticulo',1500,-45,10125,13335),(6,'frmKardex',795,-300,9570,14265),(7,'frmClientes',8430,435,8610,7740),(8,'frmBuscarCliente',2235,780,8925,13200),(9,'frmCompra',2730,-210,9990,14700),(10,'frmBuscarProveedor',3720,75,8730,13110),(11,'frmAuxiliarProveedor',1635,750,5955,9930),(12,'frmProveedor',4515,270,6345,7035),(13,'frmVerPedido',1905,285,6855,9300),(14,'frmListadoPedidos',2100,1095,4785,8130),(15,'frmDatosEmpresa',5400,210,7545,7110),(16,'frmDistribuirArt',1620,450,5610,9075),(17,'frmDevolucionComp',1440,135,7620,9045),(18,'frmCuentasXcobrar',45,315,9540,15915),(19,'frmInicializarCaja',2520,1560,3360,6705),(20,'frmArqueoCajaMenor',3255,1170,4440,4905),(21,'frmCaja',2835,795,3135,6405),(22,'frmCrearCuetaB',3345,2070,3165,8445),(23,'frmVentas',0,0,6930,9360),(24,'frmVentaArt',3840,1890,9075,16290),(25,'frmCuentasXpagar',4770,765,8265,9870),(26,'frmAuxliarBancos',1455,495,8610,10950),(27,'frmConsignaciones',3180,525,5220,5595),(28,'frmPagoFCliente',6480,330,9570,8205),(29,'frmAuxiliarClientes',4800,270,5910,9540),(30,'frmPagoFProveedor',14010,345,9450,6765),(31,'frmAuxiliarCaja',3915,-15,8085,10905),(32,'frmGastos',11265,750,7425,7995),(33,'frmCrearCuenta',6210,3300,3060,6000),(34,'frmDevolucionVent',1875,825,6840,10530),(35,'frmGaficoVenta',3270,1200,7080,9390),(36,'frmProcesarSaldos',4215,2670,1095,4185),(37,'frmCorreccionManual',5010,1695,6570,10590),(38,'frmCrearUsuario',6510,165,8280,11040),(39,'frmExportarAux',8865,930,5535,5370),(40,'frmCopiaSeguridad',5100,990,5385,7245),(41,'frmRestaurarCopia',3660,1410,3315,5130),(42,'frmAcrcade',3900,1530,4215,4770),(43,'frmListadoFacturas',1860,945,8295,16995),(44,NULL,330,435,5025,10290),(45,'frmProcesarCant',4290,2565,1140,4065),(46,'frmVerfactura',3300,330,7725,14370),(47,'frmOrdenProd',5415,135,6450,8460),(48,'frmControlCaja',8190,855,5355,6360),(49,'frmEmpleados',3300,915,6765,10170),(50,'frmUtilidadEmpleado',1920,-645,7740,8520),(51,'frmGanaciaPrecio',3225,900,3990,4800),(52,'frmListadoEgresos',8100,2250,4575,8100),(53,'frmAgregarFactura',8490,2955,3330,3645),(54,'frmNotaCredito',120,2670,3540,7140),(55,'frmAgregarFactComp',9975,3375,4305,4260),(56,'frmResultados',4740,30,5175,4905),(57,'frmListadoPagos',4845,1035,8250,14055),(58,'frmInventarioMes',3285,1275,3075,4800),(59,'frmCorregirA',5070,2985,5655,9345),(60,'frmFacturasCompra',3105,315,8550,14910),(61,'frmArticulosCompra',4275,345,8790,13950),(62,'frmOpcionesAdicio',9975,1995,3765,5835),(63,'frmCambio',1530,60,4380,8460),(64,'frmFechaInforme',5940,1785,1890,4545),(65,'frmTemppVenta',-60,-450,10230,15420),(66,'frmRastreoIngresos',195,5340,3570,5550),(67,'frmCuentasUsuario',3945,585,5745,7800),(68,'frmBuscarUsuario',7650,1545,4170,9015),(69,'frmFacturasAbiertas',3420,2970,4500,8475),(70,'frmCodigoBarras',375,375,5955,8490),(71,'frmInformesPorDia',8310,2865,2070,4185),(72,'frmComprobantes',4260,1185,3420,6690),(73,'frmConfiguraciones',3750,735,7635,12210),(74,'frmPlanSepare',1500,270,8205,10965),(75,'frmAbrirCaja',8955,2490,3870,5625),(76,'frmCierredecaja',8010,0,9180,7395),(77,'frmListadoPlan',6285,750,6780,10560),(78,'frmPagosPLanSp',5205,915,7935,7920),(79,'frmListadoCierres',3285,-105,8895,11835),(80,'frmFacturasClientSel',5340,300,8955,13500),(81,'frmListadoPagosCli',6765,0,7785,11910),(83,'frmV3_BuscarProductos',5085,-210,9060,12330),(84,'frmProductosRelacionados',780,780,6780,8325),(85,'frmFacturasProveSel',2595,-180,9135,15420),(86,'frmListadoPagosPro',3180,-300,7950,12900),(87,'frmAcercaDe',6690,435,4260,6915),(88,'frmEstadisticaVentas',8490,-105,9165,8985),(89,'frmListarGastos',780,210,7710,11835),(90,'frmV3_Ventas',2730,2730,8910,12345),(91,'frmListaServicios',0,0,7530,11730),(92,'frmIngresarProductoRc',1845,-375,9180,8685),(93,'frmConsultaProductosRelacionados',1170,1170,6510,17700),(94,'frmArticulosProveedor',1500,1500,6255,17430),(95,'frmPagosClientes',1095,870,8190,17430),(96,'frmVentasClientes',0,0,6255,17430),(97,'frmPagosProveedores',1035,555,8175,14970),(98,'frmInformeRangoFecha',1875,1875,6255,17430);
/*!40000 ALTER TABLE `tblformulario` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tblkardex`
--

DROP TABLE IF EXISTS `tblkardex`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tblkardex` (
  `Id_kardex` int(11) NOT NULL DEFAULT 0,
  `Fecha` timestamp NOT NULL DEFAULT current_timestamp(),
  `Mes` varchar(15) DEFAULT 'Enero',
  `Items` int(11) DEFAULT 0,
  `Detalle` varchar(60) DEFAULT NULL,
  `C_D` int(11) DEFAULT 0,
  `Cant_Ent` float DEFAULT 0,
  `Cost_Ent` decimal(19,4) DEFAULT 0.0000,
  `Cant_Sal` float DEFAULT 0,
  `Cost_Sal` decimal(19,4) DEFAULT 0.0000,
  `Cant_Saldo` float DEFAULT 0,
  `Cost_Saldo` decimal(19,4) DEFAULT 0.0000,
  `Cost_Unit` decimal(19,4) DEFAULT 0.0000,
  PRIMARY KEY (`Id_kardex`),
  KEY `Id_kardex` (`Id_kardex`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tblkardex`
--

LOCK TABLES `tblkardex` WRITE;
/*!40000 ALTER TABLE `tblkardex` DISABLE KEYS */;
/*!40000 ALTER TABLE `tblkardex` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tblmedios_pago`
--

DROP TABLE IF EXISTS `tblmedios_pago`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tblmedios_pago` (
  `id_mediopago` int(11) NOT NULL,
  `nombre_medio` varchar(40) NOT NULL,
  PRIMARY KEY (`id_mediopago`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tblmedios_pago`
--

LOCK TABLES `tblmedios_pago` WRITE;
/*!40000 ALTER TABLE `tblmedios_pago` DISABLE KEYS */;
INSERT INTO `tblmedios_pago` VALUES (0,'Efectivo'),(1,'Tarjeta'),(2,'Bancolombia'),(3,'Nequi');
/*!40000 ALTER TABLE `tblmedios_pago` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tblmeses`
--

DROP TABLE IF EXISTS `tblmeses`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tblmeses` (
  `N_Mes` int(11) NOT NULL DEFAULT 0,
  `Mes` varchar(15) DEFAULT NULL,
  PRIMARY KEY (`N_Mes`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tblmeses`
--

LOCK TABLES `tblmeses` WRITE;
/*!40000 ALTER TABLE `tblmeses` DISABLE KEYS */;
INSERT INTO `tblmeses` VALUES (1,'Enero'),(2,'Febrero'),(3,'Marzo'),(4,'Abril'),(5,'Mayo'),(6,'Junio'),(7,'Julio'),(8,'Agosto'),(9,'Septiembre'),(10,'Octubre'),(11,'Noviembre'),(12,'Diciembre');
/*!40000 ALTER TABLE `tblmeses` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tblmovimiento`
--

DROP TABLE IF EXISTS `tblmovimiento`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tblmovimiento` (
  `ID_Asi` int(11) NOT NULL AUTO_INCREMENT,
  `Movimiento_N` int(11) DEFAULT 0,
  `Fecha` timestamp NOT NULL DEFAULT current_timestamp(),
  `Mes` int(11) DEFAULT 0,
  `Año` int(11) DEFAULT 0,
  `Cuenta` varchar(50) DEFAULT '0',
  `Valor` decimal(19,4) DEFAULT 0.0000,
  `En` varchar(10) DEFAULT NULL,
  `Items` int(11) DEFAULT 0,
  `Id_TipoMoviento` int(11) DEFAULT 0,
  PRIMARY KEY (`ID_Asi`),
  KEY `ID_Asi` (`ID_Asi`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tblmovimiento`
--

LOCK TABLES `tblmovimiento` WRITE;
/*!40000 ALTER TABLE `tblmovimiento` DISABLE KEYS */;
/*!40000 ALTER TABLE `tblmovimiento` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tblordenproduccion`
--

DROP TABLE IF EXISTS `tblordenproduccion`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tblordenproduccion` (
  `Orden_N` int(11) NOT NULL DEFAULT 0,
  `Fecha` timestamp NOT NULL DEFAULT current_timestamp(),
  `N_Mes` int(11) DEFAULT 0,
  `Año` int(11) DEFAULT 0,
  `Tipo` varchar(20) DEFAULT 'Cont',
  `Dias` int(11) DEFAULT 0,
  `Id_Cliente` int(11) DEFAULT 0,
  `A_nombre` varchar(70) DEFAULT '-',
  `Identificacion` varchar(20) DEFAULT NULL,
  `Direccion` varchar(50) DEFAULT '-',
  `Telefono` varchar(50) DEFAULT '0',
  `Iva` decimal(19,4) DEFAULT 0.0000,
  `Total` decimal(19,4) DEFAULT 0.0000,
  `Utilidad` decimal(19,4) DEFAULT 0.0000,
  `Obervaciones` text DEFAULT NULL,
  PRIMARY KEY (`Orden_N`),
  KEY `Identificacion` (`Identificacion`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tblordenproduccion`
--

LOCK TABLES `tblordenproduccion` WRITE;
/*!40000 ALTER TABLE `tblordenproduccion` DISABLE KEYS */;
/*!40000 ALTER TABLE `tblordenproduccion` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tblpagos`
--

DROP TABLE IF EXISTS `tblpagos`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tblpagos` (
  `Id_Pagos` int(11) NOT NULL AUTO_INCREMENT,
  `RecCajaN` int(11) DEFAULT NULL,
  `Codigo` int(11) DEFAULT NULL,
  `Fact_N` int(11) DEFAULT NULL,
  `ValorPago` decimal(19,4) DEFAULT NULL,
  `Fecha` datetime DEFAULT NULL,
  `DetallePago` varchar(200) DEFAULT NULL,
  `ValorFact` decimal(19,4) DEFAULT NULL,
  `SaldoAct` decimal(19,4) DEFAULT NULL,
  `Descuento` double DEFAULT NULL,
  `Retencion` decimal(19,4) DEFAULT NULL,
  `IVARetenido` decimal(19,4) DEFAULT NULL,
  `Estado` varchar(10) DEFAULT NULL,
  `Afectada` varchar(50) DEFAULT NULL,
  `id_mediopago` int(11) NOT NULL,
  `Cuentas` varchar(80) DEFAULT NULL,
  `SaldoTotal` decimal(19,4) DEFAULT NULL,
  `NFactAnt` varchar(15) DEFAULT NULL,
  `Fact_Plan` int(11) DEFAULT NULL,
  `Cedula` varchar(20) DEFAULT NULL,
  `RecibidoDe` varchar(60) DEFAULT NULL,
  `NRemision` int(11) DEFAULT NULL,
  `FechaMod` datetime DEFAULT NULL,
  PRIMARY KEY (`Id_Pagos`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tblpagos`
--

LOCK TABLES `tblpagos` WRITE;
/*!40000 ALTER TABLE `tblpagos` DISABLE KEYS */;
/*!40000 ALTER TABLE `tblpagos` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tblpedidos`
--

DROP TABLE IF EXISTS `tblpedidos`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tblpedidos` (
  `Pedido_N` int(11) NOT NULL DEFAULT 0,
  `FacturaCompra_N` int(11) DEFAULT 0,
  `N_Mes` int(11) DEFAULT 0,
  `anio` int(11) DEFAULT NULL,
  `Fecha` timestamp NOT NULL DEFAULT current_timestamp(),
  `TipoPedido` varchar(8) DEFAULT 'Contado',
  `Dias` int(11) DEFAULT 0,
  `CodigoPro` int(11) DEFAULT 0,
  `Impuesto` decimal(19,4) DEFAULT 0.0000,
  `Descuento` decimal(19,4) DEFAULT 0.0000,
  `Flete` decimal(19,4) DEFAULT 0.0000,
  `Total` decimal(19,4) DEFAULT 0.0000,
  `Saldo` decimal(19,4) DEFAULT 0.0000,
  `EstadoPedido` varchar(15) DEFAULT 'Recibido',
  `Comentario` text DEFAULT NULL,
  `Retencion` decimal(19,4) DEFAULT NULL,
  `opcion_factura` int(11) NOT NULL,
  PRIMARY KEY (`Pedido_N`),
  KEY `CodigoPro` (`CodigoPro`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tblpedidos`
--

LOCK TABLES `tblpedidos` WRITE;
/*!40000 ALTER TABLE `tblpedidos` DISABLE KEYS */;
/*!40000 ALTER TABLE `tblpedidos` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tblporcentajeutilidad`
--

DROP TABLE IF EXISTS `tblporcentajeutilidad`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tblporcentajeutilidad` (
  `Id_Ganancia` int(11) NOT NULL AUTO_INCREMENT,
  `Rango1` decimal(19,4) DEFAULT 0.0000,
  `Rango2` decimal(19,4) DEFAULT 0.0000,
  `Porcentaje` double DEFAULT 0,
  PRIMARY KEY (`Id_Ganancia`),
  KEY `Id_Ganancia` (`Id_Ganancia`)
) ENGINE=MyISAM AUTO_INCREMENT=15 DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tblporcentajeutilidad`
--

LOCK TABLES `tblporcentajeutilidad` WRITE;
/*!40000 ALTER TABLE `tblporcentajeutilidad` DISABLE KEYS */;
INSERT INTO `tblporcentajeutilidad` VALUES (10,0.0000,0.0000,0),(11,0.0000,0.0000,0),(12,0.0000,0.0000,0),(13,25.0000,40.0000,0),(14,1.0000,21.0000,0);
/*!40000 ALTER TABLE `tblporcentajeutilidad` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tblproductosrelacionados`
--

DROP TABLE IF EXISTS `tblproductosrelacionados`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tblproductosrelacionados` (
  `ID_ProductoRelacionados` int(11) NOT NULL AUTO_INCREMENT,
  `CodigoPro` int(11) DEFAULT 0,
  `CodigoProRelacionado` int(11) DEFAULT 0,
  `Cantidad` int(11) DEFAULT 0,
  PRIMARY KEY (`ID_ProductoRelacionados`),
  KEY `ID_ProductoRelacionados` (`ID_ProductoRelacionados`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tblproductosrelacionados`
--

LOCK TABLES `tblproductosrelacionados` WRITE;
/*!40000 ALTER TABLE `tblproductosrelacionados` DISABLE KEYS */;
/*!40000 ALTER TABLE `tblproductosrelacionados` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tblproveedores`
--

DROP TABLE IF EXISTS `tblproveedores`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tblproveedores` (
  `CodigoPro` int(11) NOT NULL AUTO_INCREMENT,
  `RazonSocial` varchar(50) DEFAULT NULL,
  `Nit` varchar(15) DEFAULT NULL,
  `Direccion` varchar(50) DEFAULT NULL,
  `Telefonos` varchar(30) DEFAULT NULL,
  `Nombres` varchar(50) DEFAULT NULL,
  `Apellidos` varchar(20) DEFAULT NULL,
  `Identificacion` int(11) DEFAULT NULL,
  `Telefonos_C` varchar(30) DEFAULT NULL,
  `Direccion_C` varchar(50) DEFAULT NULL,
  `Empresa` varchar(30) DEFAULT NULL,
  `CuentaN` varchar(50) DEFAULT NULL,
  `Fecha_Iingreso` datetime DEFAULT NULL,
  `FechaMod` datetime DEFAULT NULL,
  PRIMARY KEY (`CodigoPro`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tblproveedores`
--

LOCK TABLES `tblproveedores` WRITE;
/*!40000 ALTER TABLE `tblproveedores` DISABLE KEYS */;
/*!40000 ALTER TABLE `tblproveedores` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tblreferencia`
--

DROP TABLE IF EXISTS `tblreferencia`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tblreferencia` (
  `Id_Referencia` int(11) NOT NULL AUTO_INCREMENT,
  `Referencia` varchar(20) DEFAULT NULL,
  PRIMARY KEY (`Id_Referencia`),
  KEY `Id_Referencia` (`Id_Referencia`)
) ENGINE=MyISAM AUTO_INCREMENT=128 DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tblreferencia`
--

LOCK TABLES `tblreferencia` WRITE;
/*!40000 ALTER TABLE `tblreferencia` DISABLE KEYS */;
INSERT INTO `tblreferencia` VALUES (15,'-'),(127,'Unidad');
/*!40000 ALTER TABLE `tblreferencia` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tblreferenciasarticulos`
--

DROP TABLE IF EXISTS `tblreferenciasarticulos`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tblreferenciasarticulos` (
  `idRefeArt` int(11) NOT NULL AUTO_INCREMENT,
  `Id_DetalleVenta` int(11) NOT NULL,
  `RerenciaPro` varchar(100) NOT NULL,
  KEY `idRefeArt` (`idRefeArt`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tblreferenciasarticulos`
--

LOCK TABLES `tblreferenciasarticulos` WRITE;
/*!40000 ALTER TABLE `tblreferenciasarticulos` DISABLE KEYS */;
/*!40000 ALTER TABLE `tblreferenciasarticulos` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tblregistro`
--

DROP TABLE IF EXISTS `tblregistro`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tblregistro` (
  `id_registro` int(11) NOT NULL AUTO_INCREMENT,
  `propietario` varchar(30) NOT NULL,
  `nit` varchar(20) NOT NULL,
  `serial` varchar(100) NOT NULL,
  `id_maquina` varchar(50) NOT NULL,
  `fecha_registro` date NOT NULL,
  PRIMARY KEY (`id_registro`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tblregistro`
--

LOCK TABLES `tblregistro` WRITE;
/*!40000 ALTER TABLE `tblregistro` DISABLE KEYS */;
INSERT INTO `tblregistro` VALUES (1,'Heidi Viloria Ferrer','1.068.577.815-0','FCC-3F9A-CDE-6277-AB8-8586','178BFBFF008A0F00','2025-06-05'),(3,'Heidi Viloria Ferrer','1.068.577.815-0','87C-384A-58E-5B27-368-7E36','0000000005','2025-02-08'),(4,'Heidi','1.068.577.815-0','97A-4948-68C-6C25-466-8F34','0000_0000_0000_0000_ACE4_2E00_4116_DECC.','2025-02-08'),(5,'Heidi Viloria Ferrer','1.068.577.815-0','04C-401A-D5E-62F7-B38-8606','E823_8FA6_BF53_0001_001B_448B_4CBF_A0BB.','2025-02-26'),(6,'Heidi Viloria Ferrer','1.068.577.815-0','FCC-3F9A-CDE-6277-AB8-8586','0000_0000_0000_0000_0026_B778_43B3_C1B5.','2025-02-26');
/*!40000 ALTER TABLE `tblregistro` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tblregistroproducto`
--

DROP TABLE IF EXISTS `tblregistroproducto`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tblregistroproducto` (
  `ID_Registro` varchar(15) NOT NULL,
  `Codigo` text DEFAULT NULL,
  PRIMARY KEY (`ID_Registro`),
  KEY `ID_Registro` (`ID_Registro`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tblregistroproducto`
--

LOCK TABLES `tblregistroproducto` WRITE;
/*!40000 ALTER TABLE `tblregistroproducto` DISABLE KEYS */;
INSERT INTO `tblregistroproducto` VALUES ('LFMR - 0004','011001110001000110110011011101101001011010101001110101001011001101010101110010111000011001010100001001111');
/*!40000 ALTER TABLE `tblregistroproducto` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tblsaldosfact`
--

DROP TABLE IF EXISTS `tblsaldosfact`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tblsaldosfact` (
  `Id_SaldoF` int(11) NOT NULL AUTO_INCREMENT,
  `Cuenta` varchar(15) DEFAULT NULL,
  `Valor` decimal(19,4) DEFAULT 0.0000,
  `Saldo` decimal(19,4) DEFAULT 0.0000,
  PRIMARY KEY (`Id_SaldoF`),
  KEY `Id_SaldoF` (`Id_SaldoF`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tblsaldosfact`
--

LOCK TABLES `tblsaldosfact` WRITE;
/*!40000 ALTER TABLE `tblsaldosfact` DISABLE KEYS */;
/*!40000 ALTER TABLE `tblsaldosfact` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tbltempfactutilidad`
--

DROP TABLE IF EXISTS `tbltempfactutilidad`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tbltempfactutilidad` (
  `Factura_N` int(11) DEFAULT 0,
  `Fecha` datetime DEFAULT NULL,
  `Tipo` varchar(8) DEFAULT NULL,
  `Cantidad` int(11) DEFAULT 0,
  `PrecioV` decimal(19,4) DEFAULT 0.0000,
  `PrecioCostoReal` decimal(19,4) DEFAULT 0.0000,
  `Subtotal` decimal(19,4) DEFAULT 0.0000,
  `Total` decimal(19,4) DEFAULT 0.0000,
  `N_Mes` int(11) DEFAULT 0,
  `Año` int(11) DEFAULT 0,
  `UtilidadBru` decimal(19,4) DEFAULT 0.0000
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tbltempfactutilidad`
--

LOCK TABLES `tbltempfactutilidad` WRITE;
/*!40000 ALTER TABLE `tbltempfactutilidad` DISABLE KEYS */;
/*!40000 ALTER TABLE `tbltempfactutilidad` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tbltemplistadofactuvenc`
--

DROP TABLE IF EXISTS `tbltemplistadofactuvenc`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tbltemplistadofactuvenc` (
  `NFactura` varchar(30) DEFAULT NULL,
  `Fecha` datetime DEFAULT NULL,
  `Dias` int(11) DEFAULT 0,
  `FechaVenc` datetime DEFAULT NULL,
  `Total` decimal(19,4) DEFAULT 0.0000,
  `Saldo` decimal(19,4) DEFAULT 0.0000,
  `Codigo` int(11) DEFAULT 0,
  `Nombre` varchar(80) DEFAULT NULL,
  `Empresa` varchar(100) DEFAULT NULL,
  `Informe` varchar(50) DEFAULT NULL,
  `DiasVenc` int(11) DEFAULT NULL,
  `SinVencer` decimal(19,4) DEFAULT NULL,
  `De1a30` int(11) DEFAULT 0,
  `Mas60` int(11) DEFAULT 0,
  `de31a60` int(11) DEFAULT 0
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tbltemplistadofactuvenc`
--

LOCK TABLES `tbltemplistadofactuvenc` WRITE;
/*!40000 ALTER TABLE `tbltemplistadofactuvenc` DISABLE KEYS */;
INSERT INTO `tbltemplistadofactuvenc` VALUES ('866','2025-10-10 00:00:00',30,'2025-11-09 00:00:00',130000.0000,80000.0000,130684,' Ived Florez ','AMMI ACCESORIOS','Saldo de Clientes',0,80000.0000,0,0,0),('244','2022-12-09 00:00:00',30,'2023-01-08 00:00:00',70000.0000,70000.0000,130529,'Ana Luisa','AMMI ACCESORIOS','Saldo de Clientes',1018,0.0000,0,70000,0),('861','2025-10-06 00:00:00',30,'2025-11-05 00:00:00',215000.0000,215000.0000,130513,'Andrys Alcazar ','AMMI ACCESORIOS','Saldo de Clientes',0,215000.0000,0,0,0),('270','2023-02-06 00:00:00',30,'2023-03-08 00:00:00',52000.0000,20000.0000,130587,'Angie Amiga de Deya','AMMI ACCESORIOS','Saldo de Clientes',959,0.0000,0,20000,0),('829','2025-08-08 00:00:00',30,'2025-09-07 00:00:00',240000.0000,240000.0000,130503,'Beatriz Montes','AMMI ACCESORIOS','Saldo de Clientes',45,0.0000,0,0,240000),('850','2025-09-20 00:00:00',30,'2025-10-20 00:00:00',316000.0000,316000.0000,130503,'Beatriz Montes','AMMI ACCESORIOS','Saldo de Clientes',2,0.0000,316000,0,0),('864','2025-10-10 00:00:00',30,'2025-11-09 00:00:00',55000.0000,35000.0000,130568,'Carlos Mario Martinez','AMMI ACCESORIOS','Saldo de Clientes',0,35000.0000,0,0,0),('859','2025-09-15 00:00:00',30,'2025-10-15 00:00:00',110000.0000,110000.0000,130516,'Carmen Cecilia Martínez','AMMI ACCESORIOS','Saldo de Clientes',7,0.0000,110000,0,0),('762','2025-04-10 00:00:00',30,'2025-05-10 00:00:00',15000.0000,15000.0000,130671,'Doris mamá de Ludis','AMMI ACCESORIOS','Saldo de Clientes',165,0.0000,0,15000,0),('809','2025-06-23 00:00:00',30,'2025-07-23 00:00:00',140000.0000,110000.0000,130649,'Elizabet Elida','AMMI ACCESORIOS','Saldo de Clientes',91,0.0000,0,110000,0),('246','2022-12-09 00:00:00',30,'2023-01-08 00:00:00',45000.0000,20000.0000,130592,'Enith Ricardo','AMMI ACCESORIOS','Saldo de Clientes',1018,0.0000,0,20000,0),('857','2025-09-23 00:00:00',30,'2025-10-23 00:00:00',130000.0000,130000.0000,130635,'Juan Carlos Muñoz','AMMI ACCESORIOS','Saldo de Clientes',0,130000.0000,0,0,0),('804','2025-06-14 00:00:00',30,'2025-07-14 00:00:00',140000.0000,90000.0000,130602,'Keyla Muñoz','AMMI ACCESORIOS','Saldo de Clientes',100,0.0000,0,90000,0),('845','2025-09-13 00:00:00',30,'2025-10-13 00:00:00',35000.0000,35000.0000,130510,'Leidy Modista','AMMI ACCESORIOS','Saldo de Clientes',9,0.0000,35000,0,0),('842','2025-09-08 00:00:00',30,'2025-10-08 00:00:00',25000.0000,10000.0000,130593,'Lía Negra','AMMI ACCESORIOS','Saldo de Clientes',14,0.0000,10000,0,0),('673','2024-10-13 00:00:00',30,'2024-11-12 00:00:00',120000.0000,20000.0000,130666,'Lilibeth pulseras','AMMI ACCESORIOS','Saldo de Clientes',344,0.0000,0,20000,0),('832','2025-08-13 00:00:00',30,'2025-09-12 00:00:00',35000.0000,35000.0000,130678,'LUIS FERNANDO MARTINEZ','AMMI ACCESORIOS','Saldo de Clientes',40,0.0000,0,0,35000),('833','2025-08-13 00:00:00',30,'2025-09-12 00:00:00',25000.0000,25000.0000,130678,'LUIS FERNANDO MARTINEZ','AMMI ACCESORIOS','Saldo de Clientes',40,0.0000,0,0,25000),('858','2025-09-25 00:00:00',30,'2025-10-25 00:00:00',120000.0000,120000.0000,130617,'Luz Angela Marla','AMMI ACCESORIOS','Saldo de Clientes',0,120000.0000,0,0,0),('863','2025-10-10 00:00:00',30,'2025-11-09 00:00:00',140000.0000,140000.0000,130617,'Luz Angela Marla','AMMI ACCESORIOS','Saldo de Clientes',0,140000.0000,0,0,0),('825','2025-08-02 00:00:00',30,'2025-09-01 00:00:00',130000.0000,30000.0000,130509,'Marta Martínez ','AMMI ACCESORIOS','Saldo de Clientes',51,0.0000,0,0,30000),('865','2025-10-10 00:00:00',30,'2025-11-09 00:00:00',35000.0000,35000.0000,130683,'Mary Carlos Mario ','AMMI ACCESORIOS','Saldo de Clientes',0,35000.0000,0,0,0),('868','2025-10-17 00:00:00',30,'2025-11-16 00:00:00',114900.0000,114900.0000,130685,'Mayra candelaria','AMMI ACCESORIOS','Saldo de Clientes',0,114900.0000,0,0,0),('451','2024-01-05 00:00:00',30,'2024-02-04 00:00:00',154000.0000,25000.0000,130626,'Mayuris Jirleza','AMMI ACCESORIOS','Saldo de Clientes',626,0.0000,0,25000,0),('846','2025-09-22 00:00:00',30,'2025-10-22 00:00:00',45000.0000,10000.0000,130680,'Nellys Barrera','AMMI ACCESORIOS','Saldo de Clientes',0,10000.0000,0,0,0),('856','2025-09-16 00:00:00',30,'2025-10-16 00:00:00',140000.0000,140000.0000,130533,'Osirys Rivera','AMMI ACCESORIOS','Saldo de Clientes',6,0.0000,140000,0,0),('852','2025-09-20 00:00:00',30,'2025-10-20 00:00:00',140000.0000,40000.0000,130646,'Rubeiro Cindy ','AMMI ACCESORIOS','Saldo de Clientes',2,0.0000,40000,0,0),('867','2025-10-15 00:00:00',30,'2025-11-14 00:00:00',98900.0000,98900.0000,130506,'Ruth Arrieta','AMMI ACCESORIOS','Saldo de Clientes',0,98900.0000,0,0,0),('789','2025-05-27 00:00:00',30,'2025-06-26 00:00:00',180000.0000,15000.0000,130512,'Saray Cuavas ','AMMI ACCESORIOS','Saldo de Clientes',118,0.0000,0,15000,0),('245','2022-12-09 00:00:00',30,'2023-01-08 00:00:00',65000.0000,15000.0000,130591,'Sirley Ricardo ','AMMI ACCESORIOS','Saldo de Clientes',1018,0.0000,0,15000,0),('803','2025-06-19 00:00:00',30,'2025-07-19 00:00:00',140000.0000,19000.0000,130639,'Valentina Colesper','AMMI ACCESORIOS','Saldo de Clientes',95,0.0000,0,19000,0),('626','2024-07-30 00:00:00',30,'2024-08-29 00:00:00',230000.0000,30000.0000,130657,'Ximena Diaz ','AMMI ACCESORIOS','Saldo de Clientes',419,0.0000,0,30000,0),('860','2025-09-15 00:00:00',30,'2025-10-15 00:00:00',80000.0000,50000.0000,130518,'Yineth Mercado','AMMI ACCESORIOS','Saldo de Clientes',7,0.0000,50000,0,0);
/*!40000 ALTER TABLE `tbltemplistadofactuvenc` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tbltemplistadofactuvencpro`
--

DROP TABLE IF EXISTS `tbltemplistadofactuvencpro`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tbltemplistadofactuvencpro` (
  `NFactura` varchar(30) NOT NULL,
  `Fecha` datetime NOT NULL,
  `Dias` int(11) NOT NULL,
  `DiasVenc` int(11) NOT NULL,
  `FechaVenc` datetime NOT NULL,
  `Total` decimal(19,4) NOT NULL,
  `Saldo` decimal(19,4) NOT NULL,
  `Codigo` int(11) NOT NULL,
  `Nombre` varchar(80) NOT NULL,
  `SinVencer` decimal(19,4) NOT NULL,
  `De1a30` decimal(19,4) NOT NULL,
  `de31a60` decimal(19,4) NOT NULL,
  `Mas60` decimal(19,4) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tbltemplistadofactuvencpro`
--

LOCK TABLES `tbltemplistadofactuvencpro` WRITE;
/*!40000 ALTER TABLE `tbltemplistadofactuvencpro` DISABLE KEYS */;
INSERT INTO `tbltemplistadofactuvencpro` VALUES ('129','2025-07-30 00:00:00',30,18,'2025-08-29 00:00:00',470000.0000,470000.0000,220532,'Curren Colombia',0.0000,470000.0000,0.0000,0.0000);
/*!40000 ALTER TABLE `tbltemplistadofactuvencpro` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tbltempmes`
--

DROP TABLE IF EXISTS `tbltempmes`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tbltempmes` (
  `Id` int(11) NOT NULL DEFAULT 0,
  `Año` int(11) DEFAULT 0,
  `Mes` int(11) DEFAULT 0,
  `FechaAct` timestamp NOT NULL DEFAULT current_timestamp(),
  `Fact_N` int(11) DEFAULT 0,
  `CuentaN` varchar(15) DEFAULT NULL,
  `Rec_Caja` int(11) DEFAULT 0,
  `DiasFact` int(11) DEFAULT 0,
  `CuentaN2` int(11) DEFAULT 0,
  `Fact_Temp` int(11) DEFAULT 0,
  PRIMARY KEY (`Id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tbltempmes`
--

LOCK TABLES `tbltempmes` WRITE;
/*!40000 ALTER TABLE `tbltempmes` DISABLE KEYS */;
INSERT INTO `tbltempmes` VALUES (0,2022,6,'2024-06-20 05:00:00',6953,NULL,432,0,1,0);
/*!40000 ALTER TABLE `tbltempmes` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tbltempventas`
--

DROP TABLE IF EXISTS `tbltempventas`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tbltempventas` (
  `IdTempVenta` int(11) NOT NULL AUTO_INCREMENT,
  `NFacturaTemp` int(11) DEFAULT 0,
  `CodigoCli` int(11) DEFAULT 0,
  `NombreCliente` varchar(100) NOT NULL,
  `Dias` int(11) DEFAULT 0,
  `FechaHora` datetime DEFAULT NULL,
  PRIMARY KEY (`IdTempVenta`),
  KEY `IdTempVenta` (`IdTempVenta`)
) ENGINE=MyISAM AUTO_INCREMENT=55 DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tbltempventas`
--

LOCK TABLES `tbltempventas` WRITE;
/*!40000 ALTER TABLE `tbltempventas` DISABLE KEYS */;
/*!40000 ALTER TABLE `tbltempventas` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tbltipomovimiento`
--

DROP TABLE IF EXISTS `tbltipomovimiento`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tbltipomovimiento` (
  `Id_TipoMoviento` int(11) NOT NULL AUTO_INCREMENT,
  `Movimiento` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`Id_TipoMoviento`),
  KEY `Id_TipoMoviento` (`Id_TipoMoviento`)
) ENGINE=MyISAM AUTO_INCREMENT=10 DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tbltipomovimiento`
--

LOCK TABLES `tbltipomovimiento` WRITE;
/*!40000 ALTER TABLE `tbltipomovimiento` DISABLE KEYS */;
INSERT INTO `tbltipomovimiento` VALUES (1,'Venta'),(2,'Compra'),(3,'Egreso'),(4,'Ingreso'),(5,'Devolucion x Compra'),(6,'Devolucion x Venta'),(7,'Anulación Egreso'),(8,'Anulación Ingreso'),(9,'Articulos Nuevo');
/*!40000 ALTER TABLE `tbltipomovimiento` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tbltiposusuario`
--

DROP TABLE IF EXISTS `tbltiposusuario`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tbltiposusuario` (
  `Id_TiposUsuario` int(11) NOT NULL AUTO_INCREMENT,
  `Nombre_TipoUsuario` varchar(50) DEFAULT NULL,
  `Nivel` text DEFAULT NULL,
  PRIMARY KEY (`Id_TiposUsuario`),
  KEY `Id_TiposUsuario` (`Id_TiposUsuario`)
) ENGINE=MyISAM AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tbltiposusuario`
--

LOCK TABLES `tbltiposusuario` WRITE;
/*!40000 ALTER TABLE `tbltiposusuario` DISABLE KEYS */;
INSERT INTO `tbltiposusuario` VALUES (1,'Administrador',' 0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29'),(2,'Vendedor',' 6 7 10 11 12 13 14 15 16 17 18 19 20 21 22 23'),(3,'Secretaria',' 0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 26 27 28');
/*!40000 ALTER TABLE `tbltiposusuario` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tblusuarios`
--

DROP TABLE IF EXISTS `tblusuarios`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tblusuarios` (
  `Id_Usuario` int(11) NOT NULL AUTO_INCREMENT,
  `Usuario` varchar(10) DEFAULT NULL,
  `Nombre` varchar(50) DEFAULT NULL,
  `Indentificacion` int(11) DEFAULT 0,
  `contrasena` longtext DEFAULT NULL,
  `Nivel` text DEFAULT NULL,
  `Id_TiposUsuario` int(11) DEFAULT 0,
  PRIMARY KEY (`Id_Usuario`),
  KEY `Id_TiposUsuario` (`Id_TiposUsuario`),
  KEY `Id_Usuario` (`Id_Usuario`)
) ENGINE=MyISAM AUTO_INCREMENT=12 DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tblusuarios`
--

LOCK TABLES `tblusuarios` WRITE;
/*!40000 ALTER TABLE `tblusuarios` DISABLE KEYS */;
INSERT INTO `tblusuarios` VALUES (1,'root','Luis Fernando Martinez',0,'0110001011001001100110110100',' 0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28',1);
/*!40000 ALTER TABLE `tblusuarios` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tblventas`
--

DROP TABLE IF EXISTS `tblventas`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tblventas` (
  `Factura_N` int(11) NOT NULL AUTO_INCREMENT,
  `N_Mes` int(11) DEFAULT NULL,
  `anio` int(11) DEFAULT NULL,
  `Fecha` datetime DEFAULT NULL,
  `Tipo` varchar(8) DEFAULT NULL,
  `Dias` int(11) DEFAULT NULL,
  `CodigoCli` int(11) DEFAULT NULL,
  `A_nombre` varchar(70) DEFAULT NULL,
  `Identificacion` varchar(20) DEFAULT NULL,
  `Direccion` varchar(50) DEFAULT NULL,
  `Telefono` varchar(50) DEFAULT NULL,
  `Impuesto` decimal(19,4) DEFAULT NULL,
  `Descuento` decimal(19,4) DEFAULT NULL,
  `Flete` decimal(19,4) DEFAULT NULL,
  `Total` decimal(19,4) DEFAULT NULL,
  `Saldo` decimal(19,4) DEFAULT NULL,
  `EstadoPedido` varchar(15) DEFAULT NULL,
  `Comentario` text DEFAULT NULL,
  `EstadoFact` varchar(10) DEFAULT NULL,
  `Pago` varchar(50) DEFAULT NULL,
  `Cambio` varchar(50) DEFAULT NULL,
  `Hora` varchar(50) DEFAULT NULL,
  `Id_Usuario` int(11) DEFAULT NULL,
  `Abono` decimal(19,4) DEFAULT NULL,
  `pagada` varchar(1) NOT NULL,
  `CodigoEmp` int(11) DEFAULT NULL,
  `Modifi` int(11) DEFAULT NULL,
  `FechaMod` datetime DEFAULT NULL,
  `id_mediopago` int(11) NOT NULL,
  `efectivo` double NOT NULL,
  `valorpagado1` double NOT NULL,
  PRIMARY KEY (`Factura_N`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tblventas`
--

LOCK TABLES `tblventas` WRITE;
/*!40000 ALTER TABLE `tblventas` DISABLE KEYS */;
/*!40000 ALTER TABLE `tblventas` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Temporary table structure for view `ver_factura`
--

DROP TABLE IF EXISTS `ver_factura`;
/*!50001 DROP VIEW IF EXISTS `ver_factura`*/;
SET @saved_cs_client     = @@character_set_client;
SET character_set_client = utf8;
/*!50001 CREATE VIEW `ver_factura` AS SELECT
 1 AS `Factura_N`,
  1 AS `Fecha`,
  1 AS `Hora`,
  1 AS `Tipo`,
  1 AS `Dias`,
  1 AS `A_nombre`,
  1 AS `Identificacion`,
  1 AS `Telef`,
  1 AS `Direcc`,
  1 AS `Impuesto`,
  1 AS `Descuento`,
  1 AS `Total`,
  1 AS `Saldo`,
  1 AS `Pago`,
  1 AS `Cambio`,
  1 AS `Nombre` */;
SET character_set_client = @saved_cs_client;

--
-- Temporary table structure for view `view_detalles_ventas`
--

DROP TABLE IF EXISTS `view_detalles_ventas`;
/*!50001 DROP VIEW IF EXISTS `view_detalles_ventas`*/;
SET @saved_cs_client     = @@character_set_client;
SET character_set_client = utf8;
/*!50001 CREATE VIEW `view_detalles_ventas` AS SELECT
 1 AS `Factura_N`,
  1 AS `Items`,
  1 AS `Codigo`,
  1 AS `Nombres_Articulo`,
  1 AS `PrecioV`,
  1 AS `Cantidad`,
  1 AS `IVA`,
  1 AS `DescuPro`,
  1 AS `Entregado`,
  1 AS `subtotal`,
  1 AS `impuesto` */;
SET character_set_client = @saved_cs_client;

--
-- Dumping routines for database 'conta_template'
--

--
-- Final view structure for view `ver_factura`
--

/*!50001 DROP VIEW IF EXISTS `ver_factura`*/;
/*!50001 SET @saved_cs_client          = @@character_set_client */;
/*!50001 SET @saved_cs_results         = @@character_set_results */;
/*!50001 SET @saved_col_connection     = @@collation_connection */;
/*!50001 SET character_set_client      = utf8mb3 */;
/*!50001 SET character_set_results     = utf8mb3 */;
/*!50001 SET collation_connection      = utf8mb4_general_ci */;
/*!50001 CREATE ALGORITHM=UNDEFINED */
/*!50013 DEFINER=`root`@`localhost` SQL SECURITY DEFINER */
/*!50001 VIEW `ver_factura` AS select 1 AS `Factura_N`,1 AS `Fecha`,1 AS `Hora`,1 AS `Tipo`,1 AS `Dias`,1 AS `A_nombre`,1 AS `Identificacion`,1 AS `Telef`,1 AS `Direcc`,1 AS `Impuesto`,1 AS `Descuento`,1 AS `Total`,1 AS `Saldo`,1 AS `Pago`,1 AS `Cambio`,1 AS `Nombre` */;
/*!50001 SET character_set_client      = @saved_cs_client */;
/*!50001 SET character_set_results     = @saved_cs_results */;
/*!50001 SET collation_connection      = @saved_col_connection */;

--
-- Final view structure for view `view_detalles_ventas`
--

/*!50001 DROP VIEW IF EXISTS `view_detalles_ventas`*/;
/*!50001 SET @saved_cs_client          = @@character_set_client */;
/*!50001 SET @saved_cs_results         = @@character_set_results */;
/*!50001 SET @saved_col_connection     = @@collation_connection */;
/*!50001 SET character_set_client      = utf8mb3 */;
/*!50001 SET character_set_results     = utf8mb3 */;
/*!50001 SET collation_connection      = utf8mb4_general_ci */;
/*!50001 CREATE ALGORITHM=UNDEFINED */
/*!50013 DEFINER=`root`@`localhost` SQL SECURITY DEFINER */
/*!50001 VIEW `view_detalles_ventas` AS select 1 AS `Factura_N`,1 AS `Items`,1 AS `Codigo`,1 AS `Nombres_Articulo`,1 AS `PrecioV`,1 AS `Cantidad`,1 AS `IVA`,1 AS `DescuPro`,1 AS `Entregado`,1 AS `subtotal`,1 AS `impuesto` */;
/*!50001 SET character_set_client      = @saved_cs_client */;
/*!50001 SET character_set_results     = @saved_cs_results */;
/*!50001 SET collation_connection      = @saved_col_connection */;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2026-05-08  8:39:19
